framework NIST SP 800-53 Rev 5.2.0 controls
id NIST.SP.800-53r5 AC-1
section Policy and Procedures
- Develop, document, and disseminate to :                                      access control policy that:                                           Addresses purpose, scope, roles, responsibilities, management commitment, coordination among organizational entities, and compliance; and                                                        Is consistent with applicable laws, executive orders, directives, regulations, policies, standards, and guidelines; and                                                             Procedures to facilitate the implementation of the access control policy and the associated access controls;                                                   Designate an  to manage the development, documentation, and dissemination of the access control policy and procedures; and                                        Review and update the current access control:                                     Policy  and following  ; and                                                Procedures  and following .
domain AC Access Control
baselines 
enhancements 
id NIST.SP.800-53r5 AC-10
section Concurrent Session Control
- Limit the number of concurrent sessions for each  to .
domain AC Access Control
baselines 
enhancements 
id NIST.SP.800-53r5 AC-11
section Device Lock
- Prevent further access to the system by  ; and                                        Retain the device lock until the user reestablishes access using established identification and authentication procedures.
domain AC Access Control
baselines 
enhancements AC-11(1)
id NIST.SP.800-53r5 AC-12
section Session Termination
- Automatically terminate a user session after .
domain AC Access Control
baselines 
enhancements AC-12(1) AC-12(2) AC-12(3)
id NIST.SP.800-53r5 AC-13
section Supervision and Review — Access Control
- Supervision and Review — Access Control
domain AC Access Control
baselines 
enhancements 
id NIST.SP.800-53r5 AC-14
section Permitted Actions Without Identification or Authentication
- Identify  that can be performed on the system without identification or authentication consistent with organizational mission and business functions; and                                        Document and provide supporting rationale in the security plan for the system, user actions not requiring identification or authentication.
domain AC Access Control
baselines 
enhancements AC-14(1)
id NIST.SP.800-53r5 AC-15
section Automated Marking
- Automated Marking
domain AC Access Control
baselines 
enhancements 
id NIST.SP.800-53r5 AC-16
section Security and Privacy Attributes
- Provide the means to associate  with  for information in storage, in process, and/or in transmission;                                        Ensure that the attribute associations are made and retained with the information;                                        Establish the following permitted security and privacy attributes from the attributes defined in AC-16a for : ;                                        Determine the following permitted attribute values or ranges for each of the established attributes: ;                                        Audit changes to attributes; and                                        Review  for applicability .
domain AC Access Control
baselines 
enhancements AC-16(1) AC-16(10) AC-16(2) AC-16(3) AC-16(4) AC-16(5) AC-16(6) AC-16(7) AC-16(8) AC-16(9)
id NIST.SP.800-53r5 AC-17
section Remote Access
- Establish and document usage restrictions, configuration/connection requirements, and implementation guidance for each type of remote access allowed; and                                        Authorize each type of remote access to the system prior to allowing such connections.
domain AC Access Control
baselines 
enhancements AC-17(1) AC-17(10) AC-17(2) AC-17(3) AC-17(4) AC-17(5) AC-17(6) AC-17(7) AC-17(8) AC-17(9)
id NIST.SP.800-53r5 AC-18
section Wireless Access
- Establish configuration requirements, connection requirements, and implementation guidance for each type of wireless access; and                                        Authorize each type of wireless access to the system prior to allowing such connections.
domain AC Access Control
baselines 
enhancements AC-18(1) AC-18(2) AC-18(3) AC-18(4) AC-18(5)
id NIST.SP.800-53r5 AC-19
section Access Control for Mobile Devices
- Establish configuration requirements, connection requirements, and implementation guidance for organization-controlled mobile devices, to include when such devices are outside of controlled areas; and                                        Authorize the connection of mobile devices to organizational systems.
domain AC Access Control
baselines 
enhancements AC-19(1) AC-19(2) AC-19(3) AC-19(4) AC-19(5)
id NIST.SP.800-53r5 AC-2
section Account Management
- Define and document the types of accounts allowed and specifically prohibited for use within the system;                                        Assign account managers;                                        Require  for group and role membership;                                        Specify:                                     Authorized users of the system;                                                Group and role membership; and                                                Access authorizations (i.e., privileges) and  for each account;                                                   Require approvals by  for requests to create accounts;                                        Create, enable, modify, disable, and remove accounts in accordance with ;                                        Monitor the use of accounts;                                        Notify account managers and  within:                                      when accounts are no longer required;                                                 when users are terminated or transferred; and                                                 when system usage or need-to-know changes for an individual;                                                   Authorize access to the system based on:                                     A valid access authorization;                                                Intended system usage; and                                                ;                                                   Review accounts for compliance with account management requirements ;                                        Establish and implement a process for changing shared or group account authenticators (if deployed) when individuals are removed from the group; and                                        Align account management processes with personnel termination and transfer processes.
domain AC Access Control
baselines 
enhancements AC-2(1) AC-2(10) AC-2(11) AC-2(12) AC-2(13) AC-2(2) AC-2(3) AC-2(4) AC-2(5) AC-2(6) AC-2(7) AC-2(8) AC-2(9)
id NIST.SP.800-53r5 AC-20
section Use of External Systems
- , consistent with the trust relationships established with other organizations owning, operating, and/or maintaining external systems, allowing authorized individuals to:                                     Access the system from external systems; and                                                Process, store, or transmit organization-controlled information using external systems; or                                                   Prohibit the use of .
domain AC Access Control
baselines 
enhancements AC-20(1) AC-20(2) AC-20(3) AC-20(4) AC-20(5)
id NIST.SP.800-53r5 AC-21
section Information Sharing
- Enable authorized users to determine whether access authorizations assigned to a sharing partner match the information’s access and use restrictions for  ; and                                        Employ  to assist users in making information sharing and collaboration decisions.
domain AC Access Control
baselines 
enhancements AC-21(1) AC-21(2)
id NIST.SP.800-53r5 AC-22
section Publicly Accessible Content
- Designate individuals authorized to make information publicly accessible;                                        Train authorized individuals to ensure that publicly accessible information does not contain nonpublic information;                                        Review the proposed content of information prior to posting onto the publicly accessible system to ensure that nonpublic information is not included; and                                        Review the content on the publicly accessible system for nonpublic information  and remove such information, if discovered.
domain AC Access Control
baselines 
enhancements 
id NIST.SP.800-53r5 AC-23
section Data Mining Protection
- Employ  for  to detect and protect against unauthorized data mining.
domain AC Access Control
baselines 
enhancements 
id NIST.SP.800-53r5 AC-24
section Access Control Decisions
- to ensure  are applied to each access request prior to access enforcement.
domain AC Access Control
baselines 
enhancements AC-24(1) AC-24(2)
id NIST.SP.800-53r5 AC-25
section Reference Monitor
- Implement a reference monitor for  that is tamperproof, always invoked, and small enough to be subject to analysis and testing, the completeness of which can be assured.
domain AC Access Control
baselines 
enhancements 
id NIST.SP.800-53r5 AC-3
section Access Enforcement
- Enforce approved authorizations for logical access to information and system resources in accordance with applicable access control policies.
domain AC Access Control
baselines 
enhancements AC-3(1) AC-3(10) AC-3(11) AC-3(12) AC-3(13) AC-3(14) AC-3(15) AC-3(2) AC-3(3) AC-3(4) AC-3(5) AC-3(6) AC-3(7) AC-3(8) AC-3(9)
id NIST.SP.800-53r5 AC-4
section Information Flow Enforcement
- Enforce approved authorizations for controlling the flow of information within the system and between connected systems based on .
domain AC Access Control
baselines 
enhancements AC-4(1) AC-4(10) AC-4(11) AC-4(12) AC-4(13) AC-4(14) AC-4(15) AC-4(16) AC-4(17) AC-4(18) AC-4(19) AC-4(2) AC-4(20) AC-4(21) AC-4(22) AC-4(23) AC-4(24) AC-4(25) AC-4(26) AC-4(27) AC-4(28) AC-4(29) AC-4(3) AC-4(30) AC-4(31) AC-4(32) AC-4(4) AC-4(5) AC-4(6) AC-4(7) AC-4(8) AC-4(9)
id NIST.SP.800-53r5 AC-5
section Separation of Duties
- Identify and document  ; and                                        Define system access authorizations to support separation of duties.
domain AC Access Control
baselines 
enhancements 
id NIST.SP.800-53r5 AC-6
section Least Privilege
- Employ the principle of least privilege, allowing only authorized accesses for users (or processes acting on behalf of users) that are necessary to accomplish assigned organizational tasks.
domain AC Access Control
baselines 
enhancements AC-6(1) AC-6(10) AC-6(2) AC-6(3) AC-6(4) AC-6(5) AC-6(6) AC-6(7) AC-6(8) AC-6(9)
id NIST.SP.800-53r5 AC-7
section Unsuccessful Logon Attempts
- Enforce a limit of  consecutive invalid logon attempts by a user during a  ; and                                        Automatically  when the maximum number of unsuccessful attempts is exceeded.
domain AC Access Control
baselines 
enhancements AC-7(1) AC-7(2) AC-7(3) AC-7(4)
id NIST.SP.800-53r5 AC-8
section System Use Notification
- Display  to users before granting access to the system that provides privacy and security notices consistent with applicable laws, executive orders, directives, regulations, policies, standards, and guidelines and state that:                                     Users are accessing a U.S. Government system;                                                System usage may be monitored, recorded, and subject to audit;                                                Unauthorized use of the system is prohibited and subject to criminal and civil penalties; and                                                Use of the system indicates consent to monitoring and recording;                                                   Retain the notification message or banner on the screen until users acknowledge the usage conditions and take explicit actions to log on to or further access the system; and                                        For publicly accessible systems:                                     Display system use information  , before granting further access to the publicly accessible system;                                                Display references, if any, to monitoring, recording, or auditing that are consistent with privacy accommodations for such systems that generally prohibit those activities; and                                                Include a description of the authorized uses of the system.
domain AC Access Control
baselines 
enhancements 
id NIST.SP.800-53r5 AC-9
section Previous Logon Notification
- Notify the user, upon successful logon to the system, of the date and time of the last logon.
domain AC Access Control
baselines 
enhancements AC-9(1) AC-9(2) AC-9(3) AC-9(4)
id NIST.SP.800-53r5 AT-1
section Policy and Procedures
- Develop, document, and disseminate to :                                      awareness and training policy that:                                           Addresses purpose, scope, roles, responsibilities, management commitment, coordination among organizational entities, and compliance; and                                                        Is consistent with applicable laws, executive orders, directives, regulations, policies, standards, and guidelines; and                                                             Procedures to facilitate the implementation of the awareness and training policy and the associated awareness and training controls;                                                   Designate an  to manage the development, documentation, and dissemination of the awareness and training policy and procedures; and                                        Review and update the current awareness and training:                                     Policy  and following  ; and                                                Procedures  and following .
domain AT Awareness and Training
baselines 
enhancements 
id NIST.SP.800-53r5 AT-2
section Literacy Training and Awareness
- Provide security and privacy literacy training to system users (including managers, senior executives, and contractors):                                     As part of initial training for new users and  thereafter; and                                                When required by system changes or following ;                                                   Employ the following techniques to increase the security and privacy awareness of system users ;                                        Update literacy training and awareness content  and following  ; and                                        Incorporate lessons learned from internal or external security incidents or breaches into literacy training and awareness techniques.
domain AT Awareness and Training
baselines 
enhancements AT-2(1) AT-2(2) AT-2(3) AT-2(4) AT-2(5) AT-2(6)
id NIST.SP.800-53r5 AT-3
section Role-based Training
- Provide role-based security and privacy training to personnel with the following roles and responsibilities: :                                     Before authorizing access to the system, information, or performing assigned duties, and  thereafter; and                                                When required by system changes;                                                   Update role-based training content  and following  ; and                                        Incorporate lessons learned from internal or external security incidents or breaches into role-based training.
domain AT Awareness and Training
baselines 
enhancements AT-3(1) AT-3(2) AT-3(3) AT-3(4) AT-3(5)
id NIST.SP.800-53r5 AT-4
section Training Records
- Document and monitor information security and privacy training activities, including security and privacy awareness training and specific role-based security and privacy training; and                                        Retain individual training records for .
domain AT Awareness and Training
baselines 
enhancements 
id NIST.SP.800-53r5 AT-5
section Contacts with Security Groups and Associations
- Contacts with Security Groups and Associations
domain AT Awareness and Training
baselines 
enhancements 
id NIST.SP.800-53r5 AT-6
section Training Feedback
- Provide feedback on organizational training results to the following personnel : .
domain AT Awareness and Training
baselines 
enhancements 
id NIST.SP.800-53r5 AU-1
section Policy and Procedures
- Develop, document, and disseminate to :                                      audit and accountability policy that:                                           Addresses purpose, scope, roles, responsibilities, management commitment, coordination among organizational entities, and compliance; and                                                        Is consistent with applicable laws, executive orders, directives, regulations, policies, standards, and guidelines; and                                                             Procedures to facilitate the implementation of the audit and accountability policy and the associated audit and accountability controls;                                                   Designate an  to manage the development, documentation, and dissemination of the audit and accountability policy and procedures; and                                        Review and update the current audit and accountability:                                     Policy  and following  ; and                                                Procedures  and following .
domain AU Audit and Accountability
baselines 
enhancements 
id NIST.SP.800-53r5 AU-10
section Non-repudiation
- Provide irrefutable evidence that an individual (or process acting on behalf of an individual) has performed .
domain AU Audit and Accountability
baselines 
enhancements AU-10(1) AU-10(2) AU-10(3) AU-10(4) AU-10(5)
id NIST.SP.800-53r5 AU-11
section Audit Record Retention
- Retain audit records for  to provide support for after-the-fact investigations of incidents and to meet regulatory and organizational information retention requirements.
domain AU Audit and Accountability
baselines 
enhancements AU-11(1)
id NIST.SP.800-53r5 AU-12
section Audit Record Generation
- Provide audit record generation capability for the event types the system is capable of auditing as defined in AU-2a on ;                                        Allow  to select the event types that are to be logged by specific components of the system; and                                        Generate audit records for the event types defined in AU-2c that include the audit record content defined in AU-3.
domain AU Audit and Accountability
baselines 
enhancements AU-12(1) AU-12(2) AU-12(3) AU-12(4)
id NIST.SP.800-53r5 AU-13
section Monitoring for Information Disclosure
- Monitor   for evidence of unauthorized disclosure of organizational information; and                                        If an information disclosure is discovered:                                     Notify  ; and                                                Take the following additional actions: .
domain AU Audit and Accountability
baselines 
enhancements AU-13(1) AU-13(2) AU-13(3)
id NIST.SP.800-53r5 AU-14
section Session Audit
- Provide and implement the capability for  to  the content of a user session under  ; and                                        Develop, integrate, and use session auditing activities in consultation with legal counsel and in accordance with applicable laws, executive orders, directives, regulations, policies, standards, and guidelines.
domain AU Audit and Accountability
baselines 
enhancements AU-14(1) AU-14(2) AU-14(3)
id NIST.SP.800-53r5 AU-15
section Alternate Audit Logging Capability
- Alternate Audit Logging Capability
domain AU Audit and Accountability
baselines 
enhancements 
id NIST.SP.800-53r5 AU-16
section Cross-organizational Audit Logging
- Employ  for coordinating  among external organizations when audit information is transmitted across organizational boundaries.
domain AU Audit and Accountability
baselines 
enhancements AU-16(1) AU-16(2) AU-16(3)
id NIST.SP.800-53r5 AU-2
section Event Logging
- Identify the types of events that the system is capable of logging in support of the audit function: ;                                        Coordinate the event logging function with other organizational entities requiring audit-related information to guide and inform the selection criteria for events to be logged;                                        Specify the following event types for logging within the system: ;                                        Provide a rationale for why the event types selected for logging are deemed to be adequate to support after-the-fact investigations of incidents; and                                        Review and update the event types selected for logging .
domain AU Audit and Accountability
baselines 
enhancements AU-2(1) AU-2(2) AU-2(3) AU-2(4)
id NIST.SP.800-53r5 AU-3
section Content of Audit Records
- Ensure that audit records contain information that establishes the following:                               What type of event occurred;                                        When the event occurred;                                        Where the event occurred;                                        Source of the event;                                        Outcome of the event; and                                        Identity of any individuals, subjects, or objects/entities associated with the event.
domain AU Audit and Accountability
baselines 
enhancements AU-3(1) AU-3(2) AU-3(3)
id NIST.SP.800-53r5 AU-4
section Audit Log Storage Capacity
- Allocate audit log storage capacity to accommodate .
domain AU Audit and Accountability
baselines 
enhancements AU-4(1)
id NIST.SP.800-53r5 AU-5
section Response to Audit Logging Process Failures
- Alert  within  in the event of an audit logging process failure; and                                        Take the following additional actions: .
domain AU Audit and Accountability
baselines 
enhancements AU-5(1) AU-5(2) AU-5(3) AU-5(4) AU-5(5)
id NIST.SP.800-53r5 AU-6
section Audit Record Review, Analysis, and Reporting
- Review and analyze system audit records  for indications of  and the potential impact of the inappropriate or unusual activity;                                        Report findings to  ; and                                        Adjust the level of audit record review, analysis, and reporting within the system when there is a change in risk based on law enforcement information, intelligence information, or other credible sources of information.
domain AU Audit and Accountability
baselines 
enhancements AU-6(1) AU-6(10) AU-6(2) AU-6(3) AU-6(4) AU-6(5) AU-6(6) AU-6(7) AU-6(8) AU-6(9)
id NIST.SP.800-53r5 AU-7
section Audit Record Reduction and Report Generation
- Provide and implement an audit record reduction and report generation capability that:                               Supports on-demand audit record review, analysis, and reporting requirements and after-the-fact investigations of incidents; and                                        Does not alter the original content or time ordering of audit records.
domain AU Audit and Accountability
baselines 
enhancements AU-7(1) AU-7(2)
id NIST.SP.800-53r5 AU-8
section Time Stamps
- Use internal system clocks to generate time stamps for audit records; and                                        Record time stamps for audit records that meet  and that use Coordinated Universal Time, have a fixed local time offset from Coordinated Universal Time, or that include the local time offset as part of the time stamp.
domain AU Audit and Accountability
baselines 
enhancements AU-8(1) AU-8(2)
id NIST.SP.800-53r5 AU-9
section Protection of Audit Information
- Protect audit information and audit logging tools from unauthorized access, modification, and deletion; and                                        Alert  upon detection of unauthorized access, modification, or deletion of audit information.
domain AU Audit and Accountability
baselines 
enhancements AU-9(1) AU-9(2) AU-9(3) AU-9(4) AU-9(5) AU-9(6) AU-9(7)
id NIST.SP.800-53r5 CA-1
section Policy and Procedures
- Develop, document, and disseminate to :                                      assessment, authorization, and monitoring policy that:                                           Addresses purpose, scope, roles, responsibilities, management commitment, coordination among organizational entities, and compliance; and                                                        Is consistent with applicable laws, executive orders, directives, regulations, policies, standards, and guidelines; and                                                             Procedures to facilitate the implementation of the assessment, authorization, and monitoring policy and the associated assessment, authorization, and monitoring controls;                                                   Designate an  to manage the development, documentation, and dissemination of the assessment, authorization, and monitoring policy and procedures; and                                        Review and update the current assessment, authorization, and monitoring:                                     Policy  and following  ; and                                                Procedures  and following .
domain CA Security Assessment and Authorization
baselines 
enhancements 
id NIST.SP.800-53r5 CA-2
section Control Assessments
- Select the appropriate assessor or assessment team for the type of assessment to be conducted;                                        Develop a control assessment plan that describes the scope of the assessment including:                                     Controls and control enhancements under assessment;                                                Assessment procedures to be used to determine control effectiveness; and                                                Assessment environment, assessment team, and assessment roles and responsibilities;                                                   Ensure the control assessment plan is reviewed and approved by the authorizing official or designated representative prior to conducting the assessment;                                        Assess the controls in the system and its environment of operation  to determine the extent to which the controls are implemented correctly, operating as intended, and producing the desired outcome with respect to meeting established security and privacy requirements;                                        Produce a control assessment report that document the results of the assessment; and                                        Provide the results of the control assessment to .
domain CA Security Assessment and Authorization
baselines 
enhancements CA-2(1) CA-2(2) CA-2(3)
id NIST.SP.800-53r5 CA-3
section Information Exchange
- Approve and manage the exchange of information between the system and other systems using ;                                        Document, as part of each exchange agreement, the interface characteristics, security and privacy requirements, controls, and responsibilities for each system, and the impact level of the information communicated; and                                        Review and update the agreements .
domain CA Security Assessment and Authorization
baselines 
enhancements CA-3(1) CA-3(2) CA-3(3) CA-3(4) CA-3(5) CA-3(6) CA-3(7)
id NIST.SP.800-53r5 CA-4
section Security Certification
- Security Certification
domain CA Security Assessment and Authorization
baselines 
enhancements 
id NIST.SP.800-53r5 CA-5
section Plan of Action and Milestones
- Develop a plan of action and milestones for the system to document the planned remediation actions of the organization to correct weaknesses or deficiencies noted during the assessment of the controls and to reduce or eliminate known vulnerabilities in the system; and                                        Update existing plan of action and milestones  based on the findings from control assessments, independent audits or reviews, and continuous monitoring activities.
domain CA Security Assessment and Authorization
baselines 
enhancements CA-5(1)
id NIST.SP.800-53r5 CA-6
section Authorization
- Assign a senior official as the authorizing official for the system;                                        Assign a senior official as the authorizing official for common controls available for inheritance by organizational systems;                                        Ensure that the authorizing official for the system, before commencing operations:                                     Accepts the use of common controls inherited by the system; and                                                Authorizes the system to operate;                                                   Ensure that the authorizing official for common controls authorizes the use of those controls for inheritance by organizational systems;                                        Update the authorizations .
domain CA Security Assessment and Authorization
baselines 
enhancements CA-6(1) CA-6(2)
id NIST.SP.800-53r5 CA-7
section Continuous Monitoring
- Develop a system-level continuous monitoring strategy and implement continuous monitoring in accordance with the organization-level continuous monitoring strategy that includes:                               Establishing the following system-level metrics to be monitored: ;                                        Establishing  for monitoring and  for assessment of control effectiveness;                                        Ongoing control assessments in accordance with the continuous monitoring strategy;                                        Ongoing monitoring of system and organization-defined metrics in accordance with the continuous monitoring strategy;                                        Correlation and analysis of information generated by control assessments and monitoring;                                        Response actions to address results of the analysis of control assessment and monitoring information; and                                        Reporting the security and privacy status of the system to  .
domain CA Security Assessment and Authorization
baselines 
enhancements CA-7(1) CA-7(2) CA-7(3) CA-7(4) CA-7(5) CA-7(6)
id NIST.SP.800-53r5 CA-8
section Penetration Testing
- Conduct penetration testing  on .
domain CA Security Assessment and Authorization
baselines 
enhancements CA-8(1) CA-8(2) CA-8(3)
id NIST.SP.800-53r5 CA-9
section Internal System Connections
- Authorize internal connections of  to the system;                                        Document, for each internal connection, the interface characteristics, security and privacy requirements, and the nature of the information communicated;                                        Terminate internal system connections after  ; and                                        Review  the continued need for each internal connection.
domain CA Security Assessment and Authorization
baselines 
enhancements CA-9(1)
id NIST.SP.800-53r5 CM-1
section Policy and Procedures
- Develop, document, and disseminate to :                                      configuration management policy that:                                           Addresses purpose, scope, roles, responsibilities, management commitment, coordination among organizational entities, and compliance; and                                                        Is consistent with applicable laws, executive orders, directives, regulations, policies, standards, and guidelines; and                                                             Procedures to facilitate the implementation of the configuration management policy and the associated configuration management controls;                                                   Designate an  to manage the development, documentation, and dissemination of the configuration management policy and procedures; and                                        Review and update the current configuration management:                                     Policy  and following  ; and                                                Procedures  and following .
domain CM Configuration Management
baselines 
enhancements 
id NIST.SP.800-53r5 CM-10
section Software Usage Restrictions
- Use software and associated documentation in accordance with contract agreements and copyright laws;                                        Track the use of software and associated documentation protected by quantity licenses to control copying and distribution; and                                        Control and document the use of peer-to-peer file sharing technology to ensure that this capability is not used for the unauthorized distribution, display, performance, or reproduction of copyrighted work.
domain CM Configuration Management
baselines 
enhancements CM-10(1)
id NIST.SP.800-53r5 CM-11
section User-installed Software
- Establish  governing the installation of software by users;                                        Enforce software installation policies through the following methods:  ; and                                        Monitor policy compliance .
domain CM Configuration Management
baselines 
enhancements CM-11(1) CM-11(2) CM-11(3)
id NIST.SP.800-53r5 CM-12
section Information Location
- Identify and document the location of  and the specific system components on which the information is processed and stored;                                        Identify and document the users who have access to the system and system components where the information is processed and stored; and                                        Document changes to the location (i.e., system or system components) where the information is processed and stored.
domain CM Configuration Management
baselines 
enhancements CM-12(1)
id NIST.SP.800-53r5 CM-13
section Data Action Mapping
- Develop and document a map of system data actions.
domain CM Configuration Management
baselines 
enhancements 
id NIST.SP.800-53r5 CM-14
section Signed Components
- Prevent the installation of  without verification that the component has been digitally signed using a certificate that is recognized and approved by the organization.
domain CM Configuration Management
baselines 
enhancements 
id NIST.SP.800-53r5 CM-2
section Baseline Configuration
- Develop, document, and maintain under configuration control, a current baseline configuration of the system; and                                        Review and update the baseline configuration of the system:                                     ;                                                When required due to  ; and                                                When system components are installed or upgraded.
domain CM Configuration Management
baselines 
enhancements CM-2(1) CM-2(2) CM-2(3) CM-2(4) CM-2(5) CM-2(6) CM-2(7)
id NIST.SP.800-53r5 CM-3
section Configuration Change Control
- Determine and document the types of changes to the system that are configuration-controlled;                                        Review proposed configuration-controlled changes to the system and approve or disapprove such changes with explicit consideration for security and privacy impact analyses;                                        Document configuration change decisions associated with the system;                                        Implement approved configuration-controlled changes to the system;                                        Retain records of configuration-controlled changes to the system for ;                                        Monitor and review activities associated with configuration-controlled changes to the system; and                                        Coordinate and provide oversight for configuration change control activities through  that convenes .
domain CM Configuration Management
baselines 
enhancements CM-3(1) CM-3(2) CM-3(3) CM-3(4) CM-3(5) CM-3(6) CM-3(7) CM-3(8)
id NIST.SP.800-53r5 CM-4
section Impact Analyses
- Analyze changes to the system to determine potential security and privacy impacts prior to change implementation.
domain CM Configuration Management
baselines 
enhancements CM-4(1) CM-4(2)
id NIST.SP.800-53r5 CM-5
section Access Restrictions for Change
- Define, document, approve, and enforce physical and logical access restrictions associated with changes to the system.
domain CM Configuration Management
baselines 
enhancements CM-5(1) CM-5(2) CM-5(3) CM-5(4) CM-5(5) CM-5(6) CM-5(7)
id NIST.SP.800-53r5 CM-6
section Configuration Settings
- Establish and document configuration settings for components employed within the system that reflect the most restrictive mode consistent with operational requirements using ;                                        Implement the configuration settings;                                        Identify, document, and approve any deviations from established configuration settings for  based on  ; and                                        Monitor and control changes to the configuration settings in accordance with organizational policies and procedures.
domain CM Configuration Management
baselines 
enhancements CM-6(1) CM-6(2) CM-6(3) CM-6(4)
id NIST.SP.800-53r5 CM-7
section Least Functionality
- Configure the system to provide only  ; and                                        Prohibit or restrict the use of the following functions, ports, protocols, software, and/or services: .
domain CM Configuration Management
baselines 
enhancements CM-7(1) CM-7(2) CM-7(3) CM-7(4) CM-7(5) CM-7(6) CM-7(7) CM-7(8) CM-7(9)
id NIST.SP.800-53r5 CM-8
section System Component Inventory
- Develop and document an inventory of system components that:                                     Accurately reflects the system;                                                Includes all components within the system;                                                Does not include duplicate accounting of components or components assigned to any other system;                                                Is at the level of granularity deemed necessary for tracking and reporting; and                                                Includes the following information to achieve system component accountability:  ; and                                                   Review and update the system component inventory .
domain CM Configuration Management
baselines 
enhancements CM-8(1) CM-8(2) CM-8(3) CM-8(4) CM-8(5) CM-8(6) CM-8(7) CM-8(8) CM-8(9)
id NIST.SP.800-53r5 CM-9
section Configuration Management Plan
- Develop, document, and implement a configuration management plan for the system that:                               Addresses roles, responsibilities, and configuration management processes and procedures;                                        Establishes a process for identifying configuration items throughout the system development life cycle and for managing the configuration of the configuration items;                                        Defines the configuration items for the system and places the configuration items under configuration management;                                        Is reviewed and approved by  ; and                                        Protects the configuration management plan from unauthorized disclosure and modification.
domain CM Configuration Management
baselines 
enhancements CM-9(1)
id NIST.SP.800-53r5 CP-1
section Policy and Procedures
- Develop, document, and disseminate to :                                      contingency planning policy that:                                           Addresses purpose, scope, roles, responsibilities, management commitment, coordination among organizational entities, and compliance; and                                                        Is consistent with applicable laws, executive orders, directives, regulations, policies, standards, and guidelines; and                                                             Procedures to facilitate the implementation of the contingency planning policy and the associated contingency planning controls;                                                   Designate an  to manage the development, documentation, and dissemination of the contingency planning policy and procedures; and                                        Review and update the current contingency planning:                                     Policy  and following  ; and                                                Procedures  and following .
domain CP Contingency Planning
baselines 
enhancements 
id NIST.SP.800-53r5 CP-10
section System Recovery and Reconstitution
- Provide for the recovery and reconstitution of the system to a known state within  after a disruption, compromise, or failure.
domain CP Contingency Planning
baselines 
enhancements CP-10(1) CP-10(2) CP-10(3) CP-10(4) CP-10(5) CP-10(6)
id NIST.SP.800-53r5 CP-11
section Alternate Communications Protocols
- Provide the capability to employ  in support of maintaining continuity of operations.
domain CP Contingency Planning
baselines 
enhancements 
id NIST.SP.800-53r5 CP-12
section Safe Mode
- When  are detected, enter a safe mode of operation with .
domain CP Contingency Planning
baselines 
enhancements 
id NIST.SP.800-53r5 CP-13
section Alternative Security Mechanisms
- Employ  for satisfying  when the primary means of implementing the security function is unavailable or compromised.
domain CP Contingency Planning
baselines 
enhancements 
id NIST.SP.800-53r5 CP-2
section Contingency Plan
- Develop a contingency plan for the system that:                                     Identifies essential mission and business functions and associated contingency requirements;                                                Provides recovery objectives, restoration priorities, and metrics;                                                Addresses contingency roles, responsibilities, assigned individuals with contact information;                                                Addresses maintaining essential mission and business functions despite a system disruption, compromise, or failure;                                                Addresses eventual, full system restoration without deterioration of the controls originally planned and implemented;                                                Addresses the sharing of contingency information; and                                                Is reviewed and approved by ;                                                   Distribute copies of the contingency plan to ;                                        Coordinate contingency planning activities with incident handling activities;                                        Review the contingency plan for the system ;                                        Update the contingency plan to address changes to the organization, system, or environment of operation and problems encountered during contingency plan implementation, execution, or testing;                                        Communicate contingency plan changes to ;                                        Incorporate lessons learned from contingency plan testing, training, or actual contingency activities into contingency testing and training; and                                        Protect the contingency plan from unauthorized disclosure and modification.
domain CP Contingency Planning
baselines 
enhancements CP-2(1) CP-2(2) CP-2(3) CP-2(4) CP-2(5) CP-2(6) CP-2(7) CP-2(8)
id NIST.SP.800-53r5 CP-3
section Contingency Training
- Provide contingency training to system users consistent with assigned roles and responsibilities:                                     Within  of assuming a contingency role or responsibility;                                                When required by system changes; and                                                 thereafter; and                                                   Review and update contingency training content  and following .
domain CP Contingency Planning
baselines 
enhancements CP-3(1) CP-3(2)
id NIST.SP.800-53r5 CP-4
section Contingency Plan Testing
- Test the contingency plan for the system  using the following tests to determine the effectiveness of the plan and the readiness to execute the plan: .                                        Review the contingency plan test results; and                                        Initiate corrective actions, if needed.
domain CP Contingency Planning
baselines 
enhancements CP-4(1) CP-4(2) CP-4(3) CP-4(4) CP-4(5)
id NIST.SP.800-53r5 CP-5
section Contingency Plan Update
- Contingency Plan Update
domain CP Contingency Planning
baselines 
enhancements 
id NIST.SP.800-53r5 CP-6
section Alternate Storage Site
- Establish an alternate storage site, including necessary agreements to permit the storage and retrieval of system backup information; and                                        Ensure that the alternate storage site provides controls equivalent to that of the primary site.
domain CP Contingency Planning
baselines 
enhancements CP-6(1) CP-6(2) CP-6(3)
id NIST.SP.800-53r5 CP-7
section Alternate Processing Site
- Establish an alternate processing site, including necessary agreements to permit the transfer and resumption of  for essential mission and business functions within  when the primary processing capabilities are unavailable;                                        Make available at the alternate processing site, the equipment and supplies required to transfer and resume operations or put contracts in place to support delivery to the site within the organization-defined time period for transfer and resumption; and                                        Provide controls at the alternate processing site that are equivalent to those at the primary site.
domain CP Contingency Planning
baselines 
enhancements CP-7(1) CP-7(2) CP-7(3) CP-7(4) CP-7(5) CP-7(6)
id NIST.SP.800-53r5 CP-8
section Telecommunications Services
- Establish alternate telecommunications services, including necessary agreements to permit the resumption of  for essential mission and business functions within  when the primary telecommunications capabilities are unavailable at either the primary or alternate processing or storage sites.
domain CP Contingency Planning
baselines 
enhancements CP-8(1) CP-8(2) CP-8(3) CP-8(4) CP-8(5)
id NIST.SP.800-53r5 CP-9
section System Backup
- Conduct backups of user-level information contained in  ;                                        Conduct backups of system-level information contained in the system ;                                        Conduct backups of system documentation, including security- and privacy-related documentation  ; and                                        Protect the confidentiality, integrity, and availability of backup information.
domain CP Contingency Planning
baselines 
enhancements CP-9(1) CP-9(2) CP-9(3) CP-9(4) CP-9(5) CP-9(6) CP-9(7) CP-9(8)
id NIST.SP.800-53r5 IA-1
section Policy and Procedures
- Develop, document, and disseminate to :                                      identification and authentication policy that:                                           Addresses purpose, scope, roles, responsibilities, management commitment, coordination among organizational entities, and compliance; and                                                        Is consistent with applicable laws, executive orders, directives, regulations, policies, standards, and guidelines; and                                                             Procedures to facilitate the implementation of the identification and authentication policy and the associated identification and authentication controls;                                                   Designate an  to manage the development, documentation, and dissemination of the identification and authentication policy and procedures; and                                        Review and update the current identification and authentication:                                     Policy  and following  ; and                                                Procedures  and following .
domain IA Identification and Authentication
baselines 
enhancements 
id NIST.SP.800-53r5 IA-10
section Adaptive Authentication
- Require individuals accessing the system to employ  under specific .
domain IA Identification and Authentication
baselines 
enhancements 
id NIST.SP.800-53r5 IA-11
section Re-authentication
- Require users to re-authenticate when .
domain IA Identification and Authentication
baselines 
enhancements 
id NIST.SP.800-53r5 IA-12
section Identity Proofing
- Identity proof users that require accounts for logical access to systems based on appropriate identity assurance level requirements as specified in applicable standards and guidelines;                                        Resolve user identities to a unique individual; and                                        Collect, validate, and verify identity evidence.
domain IA Identification and Authentication
baselines 
enhancements IA-12(1) IA-12(2) IA-12(3) IA-12(4) IA-12(5) IA-12(6)
id NIST.SP.800-53r5 IA-13
section Identity Providers and Authorization Servers
- Employ identity providers and authorization servers to manage user, device, and non-person entity (NPE) identities, attributes, and access rights supporting authentication and authorization decisions in accordance with  using .
domain IA Identification and Authentication
baselines 
enhancements IA-13(1) IA-13(2) IA-13(3)
id NIST.SP.800-53r5 IA-2
section Identification and Authentication (Organizational Users)
- Uniquely identify and authenticate organizational users and associate that unique identification with processes acting on behalf of those users.
domain IA Identification and Authentication
baselines 
enhancements IA-2(1) IA-2(10) IA-2(11) IA-2(12) IA-2(13) IA-2(2) IA-2(3) IA-2(4) IA-2(5) IA-2(6) IA-2(7) IA-2(8) IA-2(9)
id NIST.SP.800-53r5 IA-3
section Device Identification and Authentication
- Uniquely identify and authenticate  before establishing a  connection.
domain IA Identification and Authentication
baselines 
enhancements IA-3(1) IA-3(2) IA-3(3) IA-3(4)
id NIST.SP.800-53r5 IA-4
section Identifier Management
- Manage system identifiers by:                               Receiving authorization from  to assign an individual, group, role, service, or device identifier;                                        Selecting an identifier that identifies an individual, group, role, service, or device;                                        Assigning the identifier to the intended individual, group, role, service, or device; and                                        Preventing reuse of identifiers for .
domain IA Identification and Authentication
baselines 
enhancements IA-4(1) IA-4(2) IA-4(3) IA-4(4) IA-4(5) IA-4(6) IA-4(7) IA-4(8) IA-4(9)
id NIST.SP.800-53r5 IA-5
section Authenticator Management
- Manage system authenticators by:                               Verifying, as part of the initial authenticator distribution, the identity of the individual, group, role, service, or device receiving the authenticator;                                        Establishing initial authenticator content for any authenticators issued by the organization;                                        Ensuring that authenticators have sufficient strength of mechanism for their intended use;                                        Establishing and implementing administrative procedures for initial authenticator distribution, for lost or compromised or damaged authenticators, and for revoking authenticators;                                        Changing default authenticators prior to first use;                                        Changing or refreshing authenticators  or when  occur;                                        Protecting authenticator content from unauthorized disclosure and modification;                                        Requiring individuals to take, and having devices implement, specific controls to protect authenticators; and                                        Changing authenticators for group or role accounts when membership to those accounts changes.
domain IA Identification and Authentication
baselines 
enhancements IA-5(1) IA-5(10) IA-5(11) IA-5(12) IA-5(13) IA-5(14) IA-5(15) IA-5(16) IA-5(17) IA-5(18) IA-5(2) IA-5(3) IA-5(4) IA-5(5) IA-5(6) IA-5(7) IA-5(8) IA-5(9)
id NIST.SP.800-53r5 IA-6
section Authentication Feedback
- Obscure feedback of authentication information during the authentication process to protect the information from possible exploitation and use by unauthorized individuals.
domain IA Identification and Authentication
baselines 
enhancements 
id NIST.SP.800-53r5 IA-7
section Cryptographic Module Authentication
- Implement mechanisms for authentication to a cryptographic module that meet the requirements of applicable laws, executive orders, directives, policies, regulations, standards, and guidelines for such authentication.
domain IA Identification and Authentication
baselines 
enhancements 
id NIST.SP.800-53r5 IA-8
section Identification and Authentication (Non-organizational Users)
- Uniquely identify and authenticate non-organizational users or processes acting on behalf of non-organizational users.
domain IA Identification and Authentication
baselines 
enhancements IA-8(1) IA-8(2) IA-8(3) IA-8(4) IA-8(5) IA-8(6)
id NIST.SP.800-53r5 IA-9
section Service Identification and Authentication
- Uniquely identify and authenticate  before establishing communications with devices, users, or other services or applications.
domain IA Identification and Authentication
baselines 
enhancements IA-9(1) IA-9(2)
id NIST.SP.800-53r5 IR-1
section Policy and Procedures
- Develop, document, and disseminate to :                                      incident response policy that:                                           Addresses purpose, scope, roles, responsibilities, management commitment, coordination among organizational entities, and compliance; and                                                        Is consistent with applicable laws, executive orders, directives, regulations, policies, standards, and guidelines; and                                                             Procedures to facilitate the implementation of the incident response policy and the associated incident response controls;                                                   Designate an  to manage the development, documentation, and dissemination of the incident response policy and procedures; and                                        Review and update the current incident response:                                     Policy  and following  ; and                                                Procedures  and following .
domain IR Incident Response
baselines 
enhancements 
id NIST.SP.800-53r5 IR-10
section Integrated Information Security Analysis Team
- Integrated Information Security Analysis Team
domain IR Incident Response
baselines 
enhancements 
id NIST.SP.800-53r5 IR-2
section Incident Response Training
- Provide incident response training to system users consistent with assigned roles and responsibilities:                                     Within  of assuming an incident response role or responsibility or acquiring system access;                                                When required by system changes; and                                                 thereafter; and                                                   Review and update incident response training content  and following .
domain IR Incident Response
baselines 
enhancements IR-2(1) IR-2(2) IR-2(3)
id NIST.SP.800-53r5 IR-3
section Incident Response Testing
- Test the effectiveness of the incident response capability for the system  using the following tests: .
domain IR Incident Response
baselines 
enhancements IR-3(1) IR-3(2) IR-3(3)
id NIST.SP.800-53r5 IR-4
section Incident Handling
- Implement an incident handling capability for incidents that is consistent with the incident response plan and includes preparation, detection and analysis, containment, eradication, and recovery;                                        Coordinate incident handling activities with contingency planning activities;                                        Incorporate lessons learned from ongoing incident handling activities into incident response procedures, training, and testing, and implement the resulting changes accordingly; and                                        Ensure the rigor, intensity, scope, and results of incident handling activities are comparable and predictable across the organization.
domain IR Incident Response
baselines 
enhancements IR-4(1) IR-4(10) IR-4(11) IR-4(12) IR-4(13) IR-4(14) IR-4(15) IR-4(2) IR-4(3) IR-4(4) IR-4(5) IR-4(6) IR-4(7) IR-4(8) IR-4(9)
id NIST.SP.800-53r5 IR-5
section Incident Monitoring
- Track and document incidents.
domain IR Incident Response
baselines 
enhancements IR-5(1)
id NIST.SP.800-53r5 IR-6
section Incident Reporting
- Require personnel to report suspected incidents to the organizational incident response capability within  ; and                                        Report incident information to .
domain IR Incident Response
baselines 
enhancements IR-6(1) IR-6(2) IR-6(3)
id NIST.SP.800-53r5 IR-7
section Incident Response Assistance
- Provide an incident response support resource, integral to the organizational incident response capability, that offers advice and assistance to users of the system for the handling and reporting of incidents.
domain IR Incident Response
baselines 
enhancements IR-7(1) IR-7(2)
id NIST.SP.800-53r5 IR-8
section Incident Response Plan
- Develop an incident response plan that:                                     Provides the organization with a roadmap for implementing its incident response capability;                                                Describes the structure and organization of the incident response capability;                                                Provides a high-level approach for how the incident response capability fits into the overall organization;                                                Meets the unique requirements of the organization, which relate to mission, size, structure, and functions;                                                Defines reportable incidents;                                                Provides metrics for measuring the incident response capability within the organization;                                                Defines the resources and management support needed to effectively maintain and mature an incident response capability;                                                Addresses the sharing of incident information;                                                Is reviewed and approved by   ; and                                                Explicitly designates responsibility for incident response to .                                                   Distribute copies of the incident response plan to ;                                        Update the incident response plan to address system and organizational changes or problems encountered during plan implementation, execution, or testing;                                        Communicate incident response plan changes to  ; and                                        Protect the incident response plan from unauthorized disclosure and modification.
domain IR Incident Response
baselines 
enhancements IR-8(1)
id NIST.SP.800-53r5 IR-9
section Information Spillage Response
- Respond to information spills by:                               Assigning  with responsibility for responding to information spills;                                        Identifying the specific information involved in the system contamination;                                        Alerting  of the information spill using a method of communication not associated with the spill;                                        Isolating the contaminated system or system component;                                        Eradicating the information from the contaminated system or component;                                        Identifying other systems or system components that may have been subsequently contaminated; and                                        Performing the following additional actions: .
domain IR Incident Response
baselines 
enhancements IR-9(1) IR-9(2) IR-9(3) IR-9(4)
id NIST.SP.800-53r5 MA-1
section Policy and Procedures
- Develop, document, and disseminate to :                                      maintenance policy that:                                           Addresses purpose, scope, roles, responsibilities, management commitment, coordination among organizational entities, and compliance; and                                                        Is consistent with applicable laws, executive orders, directives, regulations, policies, standards, and guidelines; and                                                             Procedures to facilitate the implementation of the maintenance policy and the associated maintenance controls;                                                   Designate an  to manage the development, documentation, and dissemination of the maintenance policy and procedures; and                                        Review and update the current maintenance:                                     Policy  and following  ; and                                                Procedures  and following .
domain MA Maintenance
baselines 
enhancements 
id NIST.SP.800-53r5 MA-2
section Controlled Maintenance
- Schedule, document, and review records of maintenance, repair, and replacement on system components in accordance with manufacturer or vendor specifications and/or organizational requirements;                                        Approve and monitor all maintenance activities, whether performed on site or remotely and whether the system or system components are serviced on site or removed to another location;                                        Require that  explicitly approve the removal of the system or system components from organizational facilities for off-site maintenance, repair, or replacement;                                        Sanitize equipment to remove the following information from associated media prior to removal from organizational facilities for off-site maintenance, repair, or replacement: ;                                        Check all potentially impacted controls to verify that the controls are still functioning properly following maintenance, repair, or replacement actions; and                                        Include the following information in organizational maintenance records: .
domain MA Maintenance
baselines 
enhancements MA-2(1) MA-2(2)
id NIST.SP.800-53r5 MA-3
section Maintenance Tools
- Approve, control, and monitor the use of system maintenance tools; and                                        Review previously approved system maintenance tools .
domain MA Maintenance
baselines 
enhancements MA-3(1) MA-3(2) MA-3(3) MA-3(4) MA-3(5) MA-3(6)
id NIST.SP.800-53r5 MA-4
section Nonlocal Maintenance
- Approve and monitor nonlocal maintenance and diagnostic activities;                                        Allow the use of nonlocal maintenance and diagnostic tools only as consistent with organizational policy and documented in the security plan for the system;                                        Employ strong authentication in the establishment of nonlocal maintenance and diagnostic sessions;                                        Maintain records for nonlocal maintenance and diagnostic activities; and                                        Terminate session and network connections when nonlocal maintenance is completed.
domain MA Maintenance
baselines 
enhancements MA-4(1) MA-4(2) MA-4(3) MA-4(4) MA-4(5) MA-4(6) MA-4(7)
id NIST.SP.800-53r5 MA-5
section Maintenance Personnel
- Establish a process for maintenance personnel authorization and maintain a list of authorized maintenance organizations or personnel;                                        Verify that non-escorted personnel performing maintenance on the system possess the required access authorizations; and                                        Designate organizational personnel with required access authorizations and technical competence to supervise the maintenance activities of personnel who do not possess the required access authorizations.
domain MA Maintenance
baselines 
enhancements MA-5(1) MA-5(2) MA-5(3) MA-5(4) MA-5(5)
id NIST.SP.800-53r5 MA-6
section Timely Maintenance
- Obtain maintenance support and/or spare parts for  within  of failure.
domain MA Maintenance
baselines 
enhancements MA-6(1) MA-6(2) MA-6(3)
id NIST.SP.800-53r5 MA-7
section Field Maintenance
- Restrict or prohibit field maintenance on  to .
domain MA Maintenance
baselines 
enhancements 
id NIST.SP.800-53r5 MP-1
section Policy and Procedures
- Develop, document, and disseminate to :                                      media protection policy that:                                           Addresses purpose, scope, roles, responsibilities, management commitment, coordination among organizational entities, and compliance; and                                                        Is consistent with applicable laws, executive orders, directives, regulations, policies, standards, and guidelines; and                                                             Procedures to facilitate the implementation of the media protection policy and the associated media protection controls;                                                   Designate an  to manage the development, documentation, and dissemination of the media protection policy and procedures; and                                        Review and update the current media protection:                                     Policy  and following  ; and                                                Procedures  and following .
domain MP Media Protection
baselines 
enhancements 
id NIST.SP.800-53r5 MP-2
section Media Access
- Restrict access to  to .
domain MP Media Protection
baselines 
enhancements MP-2(1) MP-2(2)
id NIST.SP.800-53r5 MP-3
section Media Marking
- Mark system media indicating the distribution limitations, handling caveats, and applicable security markings (if any) of the information; and                                        Exempt  from marking if the media remain within .
domain MP Media Protection
baselines 
enhancements 
id NIST.SP.800-53r5 MP-4
section Media Storage
- Physically control and securely store  within  ; and                                        Protect system media types defined in MP-4a until the media are destroyed or sanitized using approved equipment, techniques, and procedures.
domain MP Media Protection
baselines 
enhancements MP-4(1) MP-4(2)
id NIST.SP.800-53r5 MP-5
section Media Transport
- Protect and control  during transport outside of controlled areas using ;                                        Maintain accountability for system media during transport outside of controlled areas;                                        Document activities associated with the transport of system media; and                                        Restrict the activities associated with the transport of system media to authorized personnel.
domain MP Media Protection
baselines 
enhancements MP-5(1) MP-5(2) MP-5(3) MP-5(4)
id NIST.SP.800-53r5 MP-6
section Media Sanitization
- Sanitize  prior to disposal, release out of organizational control, or release for reuse using  ; and                                        Employ sanitization mechanisms with the strength and integrity commensurate with the security category or classification of the information.
domain MP Media Protection
baselines 
enhancements MP-6(1) MP-6(2) MP-6(3) MP-6(4) MP-6(5) MP-6(6) MP-6(7) MP-6(8)
id NIST.SP.800-53r5 MP-7
section Media Use
- the use of  on  using  ; and                                        Prohibit the use of portable storage devices in organizational systems when such devices have no identifiable owner.
domain MP Media Protection
baselines 
enhancements MP-7(1) MP-7(2)
id NIST.SP.800-53r5 MP-8
section Media Downgrading
- Establish  that includes employing downgrading mechanisms with strength and integrity commensurate with the security category or classification of the information;                                        Verify that the system media downgrading process is commensurate with the security category and/or classification level of the information to be removed and the access authorizations of the potential recipients of the downgraded information;                                        Identify  ; and                                        Downgrade the identified system media using the established process.
domain MP Media Protection
baselines 
enhancements MP-8(1) MP-8(2) MP-8(3) MP-8(4)
id NIST.SP.800-53r5 PE-1
section Policy and Procedures
- Develop, document, and disseminate to :                                      physical and environmental protection policy that:                                           Addresses purpose, scope, roles, responsibilities, management commitment, coordination among organizational entities, and compliance; and                                                        Is consistent with applicable laws, executive orders, directives, regulations, policies, standards, and guidelines; and                                                             Procedures to facilitate the implementation of the physical and environmental protection policy and the associated physical and environmental protection controls;                                                   Designate an  to manage the development, documentation, and dissemination of the physical and environmental protection policy and procedures; and                                        Review and update the current physical and environmental protection:                                     Policy  and following  ; and                                                Procedures  and following .
domain PE Physical and Environmental Protection
baselines 
enhancements 
id NIST.SP.800-53r5 PE-10
section Emergency Shutoff
- Provide the capability of shutting off power to  in emergency situations;                                        Place emergency shutoff switches or devices in  to facilitate access for authorized personnel; and                                        Protect emergency power shutoff capability from unauthorized activation.
domain PE Physical and Environmental Protection
baselines 
enhancements PE-10(1)
id NIST.SP.800-53r5 PE-11
section Emergency Power
- Provide an uninterruptible power supply to facilitate  in the event of a primary power source loss.
domain PE Physical and Environmental Protection
baselines 
enhancements PE-11(1) PE-11(2)
id NIST.SP.800-53r5 PE-12
section Emergency Lighting
- Employ and maintain automatic emergency lighting for the system that activates in the event of a power outage or disruption and that covers emergency exits and evacuation routes within the facility.
domain PE Physical and Environmental Protection
baselines 
enhancements PE-12(1)
id NIST.SP.800-53r5 PE-13
section Fire Protection
- Employ and maintain fire detection and suppression systems that are supported by an independent energy source.
domain PE Physical and Environmental Protection
baselines 
enhancements PE-13(1) PE-13(2) PE-13(3) PE-13(4)
id NIST.SP.800-53r5 PE-14
section Environmental Controls
- Maintain  levels within the facility where the system resides at  ; and                                        Monitor environmental control levels .
domain PE Physical and Environmental Protection
baselines 
enhancements PE-14(1) PE-14(2)
id NIST.SP.800-53r5 PE-15
section Water Damage Protection
- Protect the system from damage resulting from water leakage by providing master shutoff or isolation valves that are accessible, working properly, and known to key personnel.
domain PE Physical and Environmental Protection
baselines 
enhancements PE-15(1)
id NIST.SP.800-53r5 PE-16
section Delivery and Removal
- Authorize and control  entering and exiting the facility; and                                        Maintain records of the system components.
domain PE Physical and Environmental Protection
baselines 
enhancements 
id NIST.SP.800-53r5 PE-17
section Alternate Work Site
- Determine and document the  allowed for use by employees;                                        Employ the following controls at alternate work sites: ;                                        Assess the effectiveness of controls at alternate work sites; and                                        Provide a means for employees to communicate with information security and privacy personnel in case of incidents.
domain PE Physical and Environmental Protection
baselines 
enhancements 
id NIST.SP.800-53r5 PE-18
section Location of System Components
- Position system components within the facility to minimize potential damage from  and to minimize the opportunity for unauthorized access.
domain PE Physical and Environmental Protection
baselines 
enhancements PE-18(1)
id NIST.SP.800-53r5 PE-19
section Information Leakage
- Protect the system from information leakage due to electromagnetic signals emanations.
domain PE Physical and Environmental Protection
baselines 
enhancements PE-19(1)
id NIST.SP.800-53r5 PE-2
section Physical Access Authorizations
- Develop, approve, and maintain a list of individuals with authorized access to the facility where the system resides;                                        Issue authorization credentials for facility access;                                        Review the access list detailing authorized facility access by individuals  ; and                                        Remove individuals from the facility access list when access is no longer required.
domain PE Physical and Environmental Protection
baselines 
enhancements PE-2(1) PE-2(2) PE-2(3)
id NIST.SP.800-53r5 PE-20
section Asset Monitoring and Tracking
- Employ  to track and monitor the location and movement of  within .
domain PE Physical and Environmental Protection
baselines 
enhancements 
id NIST.SP.800-53r5 PE-21
section Electromagnetic Pulse Protection
- Employ  against electromagnetic pulse damage for .
domain PE Physical and Environmental Protection
baselines 
enhancements 
id NIST.SP.800-53r5 PE-22
section Component Marking
- Mark  indicating the impact level or classification level of the information permitted to be processed, stored, or transmitted by the hardware component.
domain PE Physical and Environmental Protection
baselines 
enhancements 
id NIST.SP.800-53r5 PE-23
section Facility Location
- Plan the location or site of the facility where the system resides considering physical and environmental hazards; and                                        For existing facilities, consider the physical and environmental hazards in the organizational risk management strategy.
domain PE Physical and Environmental Protection
baselines 
enhancements 
id NIST.SP.800-53r5 PE-3
section Physical Access Control
- Enforce physical access authorizations at  by:                                     Verifying individual access authorizations before granting access to the facility; and                                                Controlling ingress and egress to the facility using ;                                                   Maintain physical access audit logs for ;                                        Control access to areas within the facility designated as publicly accessible by implementing the following controls: ;                                        Escort visitors and control visitor activity ;                                        Secure keys, combinations, and other physical access devices;                                        Inventory  every  ; and                                        Change combinations and keys  and/or when keys are lost, combinations are compromised, or when individuals possessing the keys or combinations are transferred or terminated.
domain PE Physical and Environmental Protection
baselines 
enhancements PE-3(1) PE-3(2) PE-3(3) PE-3(4) PE-3(5) PE-3(6) PE-3(7) PE-3(8)
id NIST.SP.800-53r5 PE-4
section Access Control for Transmission
- Control physical access to  within organizational facilities using .
domain PE Physical and Environmental Protection
baselines 
enhancements 
id NIST.SP.800-53r5 PE-5
section Access Control for Output Devices
- Control physical access to output from  to prevent unauthorized individuals from obtaining the output.
domain PE Physical and Environmental Protection
baselines 
enhancements PE-5(1) PE-5(2) PE-5(3)
id NIST.SP.800-53r5 PE-6
section Monitoring Physical Access
- Monitor physical access to the facility where the system resides to detect and respond to physical security incidents;                                        Review physical access logs  and upon occurrence of  ; and                                        Coordinate results of reviews and investigations with the organizational incident response capability.
domain PE Physical and Environmental Protection
baselines 
enhancements PE-6(1) PE-6(2) PE-6(3) PE-6(4)
id NIST.SP.800-53r5 PE-7
section Visitor Control
- Visitor Control
domain PE Physical and Environmental Protection
baselines 
enhancements 
id NIST.SP.800-53r5 PE-8
section Visitor Access Records
- Maintain visitor access records to the facility where the system resides for ;                                        Review visitor access records  ; and                                        Report anomalies in visitor access records to .
domain PE Physical and Environmental Protection
baselines 
enhancements PE-8(1) PE-8(2) PE-8(3)
id NIST.SP.800-53r5 PE-9
section Power Equipment and Cabling
- Protect power equipment and power cabling for the system from damage and destruction.
domain PE Physical and Environmental Protection
baselines 
enhancements PE-9(1) PE-9(2)
id NIST.SP.800-53r5 PL-1
section Policy and Procedures
- Develop, document, and disseminate to :                                      planning policy that:                                           Addresses purpose, scope, roles, responsibilities, management commitment, coordination among organizational entities, and compliance; and                                                        Is consistent with applicable laws, executive orders, directives, regulations, policies, standards, and guidelines; and                                                             Procedures to facilitate the implementation of the planning policy and the associated planning controls;                                                   Designate an  to manage the development, documentation, and dissemination of the planning policy and procedures; and                                        Review and update the current planning:                                     Policy  and following  ; and                                                Procedures  and following .
domain PL Planning
baselines 
enhancements 
id NIST.SP.800-53r5 PL-10
section Baseline Selection
- Select a control baseline for the system.
domain PL Planning
baselines 
enhancements 
id NIST.SP.800-53r5 PL-11
section Baseline Tailoring
- Tailor the selected control baseline by applying specified tailoring actions.
domain PL Planning
baselines 
enhancements 
id NIST.SP.800-53r5 PL-2
section System Security and Privacy Plans
- Develop security and privacy plans for the system that:                                     Are consistent with the organization’s enterprise architecture;                                                Explicitly define the constituent system components;                                                Describe the operational context of the system in terms of mission and business processes;                                                Identify the individuals that fulfill system roles and responsibilities;                                                Identify the information types processed, stored, and transmitted by the system;                                                Provide the security categorization of the system, including supporting rationale;                                                Describe any specific threats to the system that are of concern to the organization;                                                Provide the results of a privacy risk assessment for systems processing personally identifiable information;                                                Describe the operational environment for the system and any dependencies on or connections to other systems or system components;                                                Provide an overview of the security and privacy requirements for the system;                                                Identify any relevant control baselines or overlays, if applicable;                                                Describe the controls in place or planned for meeting the security and privacy requirements, including a rationale for any tailoring decisions;                                                Include risk determinations for security and privacy architecture and design decisions;                                                Include security- and privacy-related activities affecting the system that require planning and coordination with  ; and                                                Are reviewed and approved by the authorizing official or designated representative prior to plan implementation.                                                   Distribute copies of the plans and communicate subsequent changes to the plans to ;                                        Review the plans ;                                        Update the plans to address changes to the system and environment of operation or problems identified during plan implementation or control assessments; and                                        Protect the plans from unauthorized disclosure and modification.
domain PL Planning
baselines 
enhancements PL-2(1) PL-2(2) PL-2(3)
id NIST.SP.800-53r5 PL-3
section System Security Plan Update
- System Security Plan Update
domain PL Planning
baselines 
enhancements 
id NIST.SP.800-53r5 PL-4
section Rules of Behavior
- Establish and provide to individuals requiring access to the system, the rules that describe their responsibilities and expected behavior for information and system usage, security, and privacy;                                        Receive a documented acknowledgment from such individuals, indicating that they have read, understand, and agree to abide by the rules of behavior, before authorizing access to information and the system;                                        Review and update the rules of behavior  ; and                                        Require individuals who have acknowledged a previous version of the rules of behavior to read and re-acknowledge .
domain PL Planning
baselines 
enhancements PL-4(1)
id NIST.SP.800-53r5 PL-5
section Privacy Impact Assessment
- Privacy Impact Assessment
domain PL Planning
baselines 
enhancements 
id NIST.SP.800-53r5 PL-6
section Security-related Activity Planning
- Security-related Activity Planning
domain PL Planning
baselines 
enhancements 
id NIST.SP.800-53r5 PL-7
section Concept of Operations
- Develop a Concept of Operations (CONOPS) for the system describing how the organization intends to operate the system from the perspective of information security and privacy; and                                        Review and update the CONOPS .
domain PL Planning
baselines 
enhancements 
id NIST.SP.800-53r5 PL-8
section Security and Privacy Architectures
- Develop security and privacy architectures for the system that:                                     Describe the requirements and approach to be taken for protecting the confidentiality, integrity, and availability of organizational information;                                                Describe the requirements and approach to be taken for processing personally identifiable information to minimize privacy risk to individuals;                                                Describe how the architectures are integrated into and support the enterprise architecture; and                                                Describe any assumptions about, and dependencies on, external systems and services;                                                   Review and update the architectures  to reflect changes in the enterprise architecture; and                                        Reflect planned architecture changes in security and privacy plans, Concept of Operations (CONOPS), criticality analysis, organizational procedures, and procurements and acquisitions.
domain PL Planning
baselines 
enhancements PL-8(1) PL-8(2)
id NIST.SP.800-53r5 PL-9
section Central Management
- Centrally manage .
domain PL Planning
baselines 
enhancements 
id NIST.SP.800-53r5 PM-1
section Information Security Program Plan
- Develop and disseminate an organization-wide information security program plan that:                                     Provides an overview of the requirements for the security program and a description of the security program management controls and common controls in place or planned for meeting those requirements;                                                Includes the identification and assignment of roles, responsibilities, management commitment, coordination among organizational entities, and compliance;                                                Reflects the coordination among organizational entities responsible for information security; and                                                Is approved by a senior official with responsibility and accountability for the risk being incurred to organizational operations (including mission, functions, image, and reputation), organizational assets, individuals, other organizations, and the Nation;                                                   Review and update the organization-wide information security program plan  and following  ; and                                        Protect the information security program plan from unauthorized disclosure and modification.
domain PM Program Management
baselines 
enhancements 
id NIST.SP.800-53r5 PM-10
section Authorization Process
- Manage the security and privacy state of organizational systems and the environments in which those systems operate through authorization processes;                                        Designate individuals to fulfill specific roles and responsibilities within the organizational risk management process; and                                        Integrate the authorization processes into an organization-wide risk management program.
domain PM Program Management
baselines 
enhancements 
id NIST.SP.800-53r5 PM-11
section Mission and Business Process Definition
- Define organizational mission and business processes with consideration for information security and privacy and the resulting risk to organizational operations, organizational assets, individuals, other organizations, and the Nation; and                                        Determine information protection and personally identifiable information processing needs arising from the defined mission and business processes; and                                        Review and revise the mission and business processes .
domain PM Program Management
baselines 
enhancements 
id NIST.SP.800-53r5 PM-12
section Insider Threat Program
- Implement an insider threat program that includes a cross-discipline insider threat incident handling team.
domain PM Program Management
baselines 
enhancements 
id NIST.SP.800-53r5 PM-13
section Security and Privacy Workforce
- Establish a security and privacy workforce development and improvement program.
domain PM Program Management
baselines 
enhancements 
id NIST.SP.800-53r5 PM-14
section Testing, Training, and Monitoring
- Implement a process for ensuring that organizational plans for conducting security and privacy testing, training, and monitoring activities associated with organizational systems:                                     Are developed and maintained; and                                                Continue to be executed; and                                                   Review testing, training, and monitoring plans for consistency with the organizational risk management strategy and organization-wide priorities for risk response actions.
domain PM Program Management
baselines 
enhancements 
id NIST.SP.800-53r5 PM-15
section Security and Privacy Groups and Associations
- Establish and institutionalize contact with selected groups and associations within the security and privacy communities:                               To facilitate ongoing security and privacy education and training for organizational personnel;                                        To maintain currency with recommended security and privacy practices, techniques, and technologies; and                                        To share current security and privacy information, including threats, vulnerabilities, and incidents.
domain PM Program Management
baselines 
enhancements 
id NIST.SP.800-53r5 PM-16
section Threat Awareness Program
- Implement a threat awareness program that includes a cross-organization information-sharing capability for threat intelligence.
domain PM Program Management
baselines 
enhancements PM-16(1)
id NIST.SP.800-53r5 PM-17
section Protecting Controlled Unclassified Information on External Systems
- Establish policy and procedures to ensure that requirements for the protection of controlled unclassified information that is processed, stored or transmitted on external systems, are implemented in accordance with applicable laws, executive orders, directives, policies, regulations, and standards; and                                        Review and update the policy and procedures .
domain PM Program Management
baselines 
enhancements 
id NIST.SP.800-53r5 PM-18
section Privacy Program Plan
- Develop and disseminate an organization-wide privacy program plan that provides an overview of the agency’s privacy program, and:                                     Includes a description of the structure of the privacy program and the resources dedicated to the privacy program;                                                Provides an overview of the requirements for the privacy program and a description of the privacy program management controls and common controls in place or planned for meeting those requirements;                                                Includes the role of the senior agency official for privacy and the identification and assignment of roles of other privacy officials and staff and their responsibilities;                                                Describes management commitment, compliance, and the strategic goals and objectives of the privacy program;                                                Reflects coordination among organizational entities responsible for the different aspects of privacy; and                                                Is approved by a senior official with responsibility and accountability for the privacy risk being incurred to organizational operations (including mission, functions, image, and reputation), organizational assets, individuals, other organizations, and the Nation; and                                                   Update the plan  and to address changes in federal privacy laws and policy and organizational changes and problems identified during plan implementation or privacy control assessments.
domain PM Program Management
baselines 
enhancements 
id NIST.SP.800-53r5 PM-19
section Privacy Program Leadership Role
- Appoint a senior agency official for privacy with the authority, mission, accountability, and resources to coordinate, develop, and implement, applicable privacy requirements and manage privacy risks through the organization-wide privacy program.
domain PM Program Management
baselines 
enhancements 
id NIST.SP.800-53r5 PM-2
section Information Security Program Leadership Role
- Appoint a senior agency information security officer with the mission and resources to coordinate, develop, implement, and maintain an organization-wide information security program.
domain PM Program Management
baselines 
enhancements 
id NIST.SP.800-53r5 PM-20
section Dissemination of Privacy Program Information
- Maintain a central resource webpage on the organization’s principal public website that serves as a central source of information about the organization’s privacy program and that:                               Ensures that the public has access to information about organizational privacy activities and can communicate with its senior agency official for privacy;                                        Ensures that organizational privacy practices and reports are publicly available; and                                        Employs publicly facing email addresses and/or phone lines to enable the public to provide feedback and/or direct questions to privacy offices regarding privacy practices.
domain PM Program Management
baselines 
enhancements PM-20(1)
id NIST.SP.800-53r5 PM-21
section Accounting of Disclosures
- Develop and maintain an accurate accounting of disclosures of personally identifiable information, including:                                     Date, nature, and purpose of each disclosure; and                                                Name and address, or other contact information of the individual or organization to which the disclosure was made;                                                   Retain the accounting of disclosures for the length of the time the personally identifiable information is maintained or five years after the disclosure is made, whichever is longer; and                                        Make the accounting of disclosures available to the individual to whom the personally identifiable information relates upon request.
domain PM Program Management
baselines 
enhancements 
id NIST.SP.800-53r5 PM-22
section Personally Identifiable Information Quality Management
- Develop and document organization-wide policies and procedures for:                               Reviewing for the accuracy, relevance, timeliness, and completeness of personally identifiable information across the information life cycle;                                        Correcting or deleting inaccurate or outdated personally identifiable information;                                        Disseminating notice of corrected or deleted personally identifiable information to individuals or other appropriate entities; and                                        Appeals of adverse decisions on correction or deletion requests.
domain PM Program Management
baselines 
enhancements 
id NIST.SP.800-53r5 PM-23
section Data Governance Body
- Establish a Data Governance Body consisting of  with .
domain PM Program Management
baselines 
enhancements 
id NIST.SP.800-53r5 PM-24
section Data Integrity Board
- Establish a Data Integrity Board to:                               Review proposals to conduct or participate in a matching program; and                                        Conduct an annual review of all matching programs in which the agency has participated.
domain PM Program Management
baselines 
enhancements 
id NIST.SP.800-53r5 PM-25
section Minimization of Personally Identifiable Information Used in Testing, Training, and Research
- Develop, document, and implement policies and procedures that address the use of personally identifiable information for internal testing, training, and research;                                        Limit or minimize the amount of personally identifiable information used for internal testing, training, and research purposes;                                        Authorize the use of personally identifiable information when such information is required for internal testing, training, and research; and                                        Review and update policies and procedures .
domain PM Program Management
baselines 
enhancements 
id NIST.SP.800-53r5 PM-26
section Complaint Management
- Implement a process for receiving and responding to complaints, concerns, or questions from individuals about the organizational security and privacy practices that includes:                               Mechanisms that are easy to use and readily accessible by the public;                                        All information necessary for successfully filing complaints;                                        Tracking mechanisms to ensure all complaints received are reviewed and addressed within ;                                        Acknowledgement of receipt of complaints, concerns, or questions from individuals within  ; and                                        Response to complaints, concerns, or questions from individuals within .
domain PM Program Management
baselines 
enhancements 
id NIST.SP.800-53r5 PM-27
section Privacy Reporting
- Develop  and disseminate to:                                      to demonstrate accountability with statutory, regulatory, and policy privacy mandates; and                                                 and other personnel with responsibility for monitoring privacy program compliance; and                                                   Review and update privacy reports .
domain PM Program Management
baselines 
enhancements 
id NIST.SP.800-53r5 PM-28
section Risk Framing
- Identify and document:                                     Assumptions affecting risk assessments, risk responses, and risk monitoring;                                                Constraints affecting risk assessments, risk responses, and risk monitoring;                                                Priorities and trade-offs considered by the organization for managing risk; and                                                Organizational risk tolerance;                                                   Distribute the results of risk framing activities to  ; and                                        Review and update risk framing considerations .
domain PM Program Management
baselines 
enhancements 
id NIST.SP.800-53r5 PM-29
section Risk Management Program Leadership Roles
- Appoint a Senior Accountable Official for Risk Management to align organizational information security and privacy management processes with strategic, operational, and budgetary planning processes; and                                        Establish a Risk Executive (function) to view and analyze risk from an organization-wide perspective and ensure management of risk is consistent across the organization.
domain PM Program Management
baselines 
enhancements 
id NIST.SP.800-53r5 PM-3
section Information Security and Privacy Resources
- Include the resources needed to implement the information security and privacy programs in capital planning and investment requests and document all exceptions to this requirement;                                        Prepare documentation required for addressing information security and privacy programs in capital planning and investment requests in accordance with applicable laws, executive orders, directives, policies, regulations, standards; and                                        Make available for expenditure, the planned information security and privacy resources.
domain PM Program Management
baselines 
enhancements 
id NIST.SP.800-53r5 PM-30
section Supply Chain Risk Management Strategy
- Develop an organization-wide strategy for managing supply chain risks associated with the development, acquisition, maintenance, and disposal of systems, system components, and system services;                                        Implement the supply chain risk management strategy consistently across the organization; and                                        Review and update the supply chain risk management strategy on  or as required, to address organizational changes.
domain PM Program Management
baselines 
enhancements PM-30(1)
id NIST.SP.800-53r5 PM-31
section Continuous Monitoring Strategy
- Develop an organization-wide continuous monitoring strategy and implement continuous monitoring programs that include:                               Establishing the following organization-wide metrics to be monitored: ;                                        Establishing  and  for control effectiveness;                                        Ongoing monitoring of organizationally-defined metrics in accordance with the continuous monitoring strategy;                                        Correlation and analysis of information generated by control assessments and monitoring;                                        Response actions to address results of the analysis of control assessment and monitoring information; and                                        Reporting the security and privacy status of organizational systems to  .
domain PM Program Management
baselines 
enhancements 
id NIST.SP.800-53r5 PM-32
section Purposing
- Analyze  supporting mission essential services or functions to ensure that the information resources are being used consistent with their intended purpose.
domain PM Program Management
baselines 
enhancements 
id NIST.SP.800-53r5 PM-4
section Plan of Action and Milestones Process
- Implement a process to ensure that plans of action and milestones for the information security, privacy, and supply chain risk management programs and associated organizational systems:                                     Are developed and maintained;                                                Document the remedial information security, privacy, and supply chain risk management actions to adequately respond to risk to organizational operations and assets, individuals, other organizations, and the Nation; and                                                Are reported in accordance with established reporting requirements.                                                   Review plans of action and milestones for consistency with the organizational risk management strategy and organization-wide priorities for risk response actions.
domain PM Program Management
baselines 
enhancements 
id NIST.SP.800-53r5 PM-5
section System Inventory
- Develop and update  an inventory of organizational systems.
domain PM Program Management
baselines 
enhancements PM-5(1)
id NIST.SP.800-53r5 PM-6
section Measures of Performance
- Develop, monitor, and report on the results of information security and privacy measures of performance.
domain PM Program Management
baselines 
enhancements 
id NIST.SP.800-53r5 PM-7
section Enterprise Architecture
- Develop and maintain an enterprise architecture with consideration for information security, privacy, and the resulting risk to organizational operations and assets, individuals, other organizations, and the Nation.
domain PM Program Management
baselines 
enhancements PM-7(1)
id NIST.SP.800-53r5 PM-8
section Critical Infrastructure Plan
- Address information security and privacy issues in the development, documentation, and updating of a critical infrastructure and key resources protection plan.
domain PM Program Management
baselines 
enhancements 
id NIST.SP.800-53r5 PM-9
section Risk Management Strategy
- Develops a comprehensive strategy to manage:                                     Security risk to organizational operations and assets, individuals, other organizations, and the Nation associated with the operation and use of organizational systems; and                                                Privacy risk to individuals resulting from the authorized processing of personally identifiable information;                                                   Implement the risk management strategy consistently across the organization; and                                        Review and update the risk management strategy  or as required, to address organizational changes.
domain PM Program Management
baselines 
enhancements 
id NIST.SP.800-53r5 PS-1
section Policy and Procedures
- Develop, document, and disseminate to :                                      personnel security policy that:                                           Addresses purpose, scope, roles, responsibilities, management commitment, coordination among organizational entities, and compliance; and                                                        Is consistent with applicable laws, executive orders, directives, regulations, policies, standards, and guidelines; and                                                             Procedures to facilitate the implementation of the personnel security policy and the associated personnel security controls;                                                   Designate an  to manage the development, documentation, and dissemination of the personnel security policy and procedures; and                                        Review and update the current personnel security:                                     Policy  and following  ; and                                                Procedures  and following .
domain PS Personnel Security
baselines 
enhancements 
id NIST.SP.800-53r5 PS-2
section Position Risk Designation
- Assign a risk designation to all organizational positions;                                        Establish screening criteria for individuals filling those positions; and                                        Review and update position risk designations .
domain PS Personnel Security
baselines 
enhancements 
id NIST.SP.800-53r5 PS-3
section Personnel Screening
- Screen individuals prior to authorizing access to the system; and                                        Rescreen individuals in accordance with .
domain PS Personnel Security
baselines 
enhancements PS-3(1) PS-3(2) PS-3(3) PS-3(4)
id NIST.SP.800-53r5 PS-4
section Personnel Termination
- Upon termination of individual employment:                               Disable system access within ;                                        Terminate or revoke any authenticators and credentials associated with the individual;                                        Conduct exit interviews that include a discussion of ;                                        Retrieve all security-related organizational system-related property; and                                        Retain access to organizational information and systems formerly controlled by terminated individual.
domain PS Personnel Security
baselines 
enhancements PS-4(1) PS-4(2)
id NIST.SP.800-53r5 PS-5
section Personnel Transfer
- Review and confirm ongoing operational need for current logical and physical access authorizations to systems and facilities when individuals are reassigned or transferred to other positions within the organization;                                        Initiate  within ;                                        Modify access authorization as needed to correspond with any changes in operational need due to reassignment or transfer; and                                        Notify  within .
domain PS Personnel Security
baselines 
enhancements 
id NIST.SP.800-53r5 PS-6
section Access Agreements
- Develop and document access agreements for organizational systems;                                        Review and update the access agreements  ; and                                        Verify that individuals requiring access to organizational information and systems:                                     Sign appropriate access agreements prior to being granted access; and                                                Re-sign access agreements to maintain access to organizational systems when access agreements have been updated or .
domain PS Personnel Security
baselines 
enhancements PS-6(1) PS-6(2) PS-6(3)
id NIST.SP.800-53r5 PS-7
section External Personnel Security
- Establish personnel security requirements, including security roles and responsibilities for external providers;                                        Require external providers to comply with personnel security policies and procedures established by the organization;                                        Document personnel security requirements;                                        Require external providers to notify  of any personnel transfers or terminations of external personnel who possess organizational credentials and/or badges, or who have system privileges within  ; and                                        Monitor provider compliance with personnel security requirements.
domain PS Personnel Security
baselines 
enhancements 
id NIST.SP.800-53r5 PS-8
section Personnel Sanctions
- Employ a formal sanctions process for individuals failing to comply with established information security and privacy policies and procedures; and                                        Notify  within  when a formal employee sanctions process is initiated, identifying the individual sanctioned and the reason for the sanction.
domain PS Personnel Security
baselines 
enhancements 
id NIST.SP.800-53r5 PS-9
section Position Descriptions
- Incorporate security and privacy roles and responsibilities into organizational position descriptions.
domain PS Personnel Security
baselines 
enhancements 
id NIST.SP.800-53r5 PT-1
section Policy and Procedures
- Develop, document, and disseminate to :                                      personally identifiable information processing and transparency policy that:                                           Addresses purpose, scope, roles, responsibilities, management commitment, coordination among organizational entities, and compliance; and                                                        Is consistent with applicable laws, executive orders, directives, regulations, policies, standards, and guidelines; and                                                             Procedures to facilitate the implementation of the personally identifiable information processing and transparency policy and the associated personally identifiable information processing and transparency controls;                                                   Designate an  to manage the development, documentation, and dissemination of the personally identifiable information processing and transparency policy and procedures; and                                        Review and update the current personally identifiable information processing and transparency:                                     Policy  and following  ; and                                                Procedures  and following .
domain PT Privacy
baselines 
enhancements 
id NIST.SP.800-53r5 PT-2
section Authority to Process Personally Identifiable Information
- Determine and document the  that permits the  of personally identifiable information; and                                        Restrict the  of personally identifiable information to only that which is authorized.
domain PT Privacy
baselines 
enhancements PT-2(1) PT-2(2)
id NIST.SP.800-53r5 PT-3
section Personally Identifiable Information Processing Purposes
- Identify and document the  for processing personally identifiable information;                                        Describe the purpose(s) in the public privacy notices and policies of the organization;                                        Restrict the  of personally identifiable information to only that which is compatible with the identified purpose(s); and                                        Monitor changes in processing personally identifiable information and implement  to ensure that any changes are made in accordance with .
domain PT Privacy
baselines 
enhancements PT-3(1) PT-3(2)
id NIST.SP.800-53r5 PT-4
section Consent
- Implement  for individuals to consent to the processing of their personally identifiable information prior to its collection that facilitate individuals’ informed decision-making.
domain PT Privacy
baselines 
enhancements PT-4(1) PT-4(2) PT-4(3)
id NIST.SP.800-53r5 PT-5
section Privacy Notice
- Provide notice to individuals about the processing of personally identifiable information that:                               Is available to individuals upon first interacting with an organization, and subsequently at ;                                        Is clear and easy-to-understand, expressing information about personally identifiable information processing in plain language;                                        Identifies the authority that authorizes the processing of personally identifiable information;                                        Identifies the purposes for which personally identifiable information is to be processed; and                                        Includes .
domain PT Privacy
baselines 
enhancements PT-5(1) PT-5(2)
id NIST.SP.800-53r5 PT-6
section System of Records Notice
- For systems that process information that will be maintained in a Privacy Act system of records:                               Draft system of records notices in accordance with OMB guidance and submit new and significantly modified system of records notices to the OMB and appropriate congressional committees for advance review;                                        Publish system of records notices in the Federal Register; and                                        Keep system of records notices accurate, up-to-date, and scoped in accordance with policy.
domain PT Privacy
baselines 
enhancements PT-6(1) PT-6(2)
id NIST.SP.800-53r5 PT-7
section Specific Categories of Personally Identifiable Information
- Apply  for specific categories of personally identifiable information.
domain PT Privacy
baselines 
enhancements PT-7(1) PT-7(2)
id NIST.SP.800-53r5 PT-8
section Computer Matching Requirements
- When a system or organization processes information for the purpose of conducting a matching program:                               Obtain approval from the Data Integrity Board to conduct the matching program;                                        Develop and enter into a computer matching agreement;                                        Publish a matching notice in the Federal Register;                                        Independently verify the information produced by the matching program before taking adverse action against an individual, if required; and                                        Provide individuals with notice and an opportunity to contest the findings before taking adverse action against an individual.
domain PT Privacy
baselines 
enhancements 
id NIST.SP.800-53r5 RA-1
section Policy and Procedures
- Develop, document, and disseminate to :                                      risk assessment policy that:                                           Addresses purpose, scope, roles, responsibilities, management commitment, coordination among organizational entities, and compliance; and                                                        Is consistent with applicable laws, executive orders, directives, regulations, policies, standards, and guidelines; and                                                             Procedures to facilitate the implementation of the risk assessment policy and the associated risk assessment controls;                                                   Designate an  to manage the development, documentation, and dissemination of the risk assessment policy and procedures; and                                        Review and update the current risk assessment:                                     Policy  and following  ; and                                                Procedures  and following .
domain RA Risk Assessment
baselines 
enhancements 
id NIST.SP.800-53r5 RA-10
section Threat Hunting
- Establish and maintain a cyber threat hunting capability to:                                     Search for indicators of compromise in organizational systems; and                                                Detect, track, and disrupt threats that evade existing controls; and                                                   Employ the threat hunting capability .
domain RA Risk Assessment
baselines 
enhancements 
id NIST.SP.800-53r5 RA-2
section Security Categorization
- Categorize the system and information it processes, stores, and transmits;                                        Document the security categorization results, including supporting rationale, in the security plan for the system; and                                        Verify that the authorizing official or authorizing official designated representative reviews and approves the security categorization decision.
domain RA Risk Assessment
baselines 
enhancements RA-2(1)
id NIST.SP.800-53r5 RA-3
section Risk Assessment
- Conduct a risk assessment, including:                                     Identifying threats to and vulnerabilities in the system;                                                Determining the likelihood and magnitude of harm from unauthorized access, use, disclosure, disruption, modification, or destruction of the system, the information it processes, stores, or transmits, and any related information; and                                                Determining the likelihood and impact of adverse effects on individuals arising from the processing of personally identifiable information;                                                   Integrate risk assessment results and risk management decisions from the organization and mission or business process perspectives with system-level risk assessments;                                        Document risk assessment results in ;                                        Review risk assessment results ;                                        Disseminate risk assessment results to  ; and                                        Update the risk assessment  or when there are significant changes to the system, its environment of operation, or other conditions that may impact the security or privacy state of the system.
domain RA Risk Assessment
baselines 
enhancements RA-3(1) RA-3(2) RA-3(3) RA-3(4)
id NIST.SP.800-53r5 RA-4
section Risk Assessment Update
- Risk Assessment Update
domain RA Risk Assessment
baselines 
enhancements 
id NIST.SP.800-53r5 RA-5
section Vulnerability Monitoring and Scanning
- Monitor and scan for vulnerabilities in the system and hosted applications  and when new vulnerabilities potentially affecting the system are identified and reported;                                        Employ vulnerability monitoring tools and techniques that facilitate interoperability among tools and automate parts of the vulnerability management process by using standards for:                                     Enumerating platforms, software flaws, and improper configurations;                                                Formatting checklists and test procedures; and                                                Measuring vulnerability impact;                                                   Analyze vulnerability scan reports and results from vulnerability monitoring;                                        Remediate legitimate vulnerabilities  in accordance with an organizational assessment of risk;                                        Share information obtained from the vulnerability monitoring process and control assessments with  to help eliminate similar vulnerabilities in other systems; and                                        Employ vulnerability monitoring tools that include the capability to readily update the vulnerabilities to be scanned.
domain RA Risk Assessment
baselines 
enhancements RA-5(1) RA-5(10) RA-5(11) RA-5(2) RA-5(3) RA-5(4) RA-5(5) RA-5(6) RA-5(7) RA-5(8) RA-5(9)
id NIST.SP.800-53r5 RA-6
section Technical Surveillance Countermeasures Survey
- Employ a technical surveillance countermeasures survey at  .
domain RA Risk Assessment
baselines 
enhancements 
id NIST.SP.800-53r5 RA-7
section Risk Response
- Respond to findings from security and privacy assessments, monitoring, and audits in accordance with organizational risk tolerance.
domain RA Risk Assessment
baselines 
enhancements 
id NIST.SP.800-53r5 RA-8
section Privacy Impact Assessments
- Conduct privacy impact assessments for systems, programs, or other activities before:                               Developing or procuring information technology that processes personally identifiable information; and                                        Initiating a new collection of personally identifiable information that:                                     Will be processed using information technology; and                                                Includes personally identifiable information permitting the physical or virtual (online) contacting of a specific individual, if identical questions have been posed to, or identical reporting requirements imposed on, ten or more individuals, other than agencies, instrumentalities, or employees of the federal government.
domain RA Risk Assessment
baselines 
enhancements 
id NIST.SP.800-53r5 RA-9
section Criticality Analysis
- Identify critical system components and functions by performing a criticality analysis for  at .
domain RA Risk Assessment
baselines 
enhancements 
id NIST.SP.800-53r5 SA-1
section Policy and Procedures
- Develop, document, and disseminate to :                                      system and services acquisition policy that:                                           Addresses purpose, scope, roles, responsibilities, management commitment, coordination among organizational entities, and compliance; and                                                        Is consistent with applicable laws, executive orders, directives, regulations, policies, standards, and guidelines; and                                                             Procedures to facilitate the implementation of the system and services acquisition policy and the associated system and services acquisition controls;                                                   Designate an  to manage the development, documentation, and dissemination of the system and services acquisition policy and procedures; and                                        Review and update the current system and services acquisition:                                     Policy  and following  ; and                                                Procedures  and following .
domain SA System and Services Acquisition
baselines 
enhancements 
id NIST.SP.800-53r5 SA-10
section Developer Configuration Management
- Require the developer of the system, system component, or system service to:                               Perform configuration management during system, component, or service ;                                        Document, manage, and control the integrity of changes to ;                                        Implement only organization-approved changes to the system, component, or service;                                        Document approved changes to the system, component, or service and the potential security and privacy impacts of such changes; and                                        Track security flaws and flaw resolution within the system, component, or service and report findings to .
domain SA System and Services Acquisition
baselines 
enhancements SA-10(1) SA-10(2) SA-10(3) SA-10(4) SA-10(5) SA-10(6) SA-10(7)
id NIST.SP.800-53r5 SA-11
section Developer Testing and Evaluation
- Require the developer of the system, system component, or system service, at all post-design stages of the system development life cycle, to:                               Develop and implement a plan for ongoing security and privacy control assessments;                                        Perform  testing/evaluation  at ;                                        Produce evidence of the execution of the assessment plan and the results of the testing and evaluation;                                        Implement a verifiable flaw remediation process; and                                        Correct flaws identified during testing and evaluation.
domain SA System and Services Acquisition
baselines 
enhancements SA-11(1) SA-11(2) SA-11(3) SA-11(4) SA-11(5) SA-11(6) SA-11(7) SA-11(8) SA-11(9)
id NIST.SP.800-53r5 SA-12
section Supply Chain Protection
- Supply Chain Protection
domain SA System and Services Acquisition
baselines 
enhancements SA-12(1) SA-12(10) SA-12(11) SA-12(12) SA-12(13) SA-12(14) SA-12(15) SA-12(2) SA-12(3) SA-12(4) SA-12(5) SA-12(6) SA-12(7) SA-12(8) SA-12(9)
id NIST.SP.800-53r5 SA-13
section Trustworthiness
- Trustworthiness
domain SA System and Services Acquisition
baselines 
enhancements 
id NIST.SP.800-53r5 SA-14
section Criticality Analysis
- Criticality Analysis
domain SA System and Services Acquisition
baselines 
enhancements SA-14(1)
id NIST.SP.800-53r5 SA-15
section Development Process, Standards, and Tools
- Require the developer of the system, system component, or system service to follow a documented development process that:                                     Explicitly addresses security and privacy requirements;                                                Identifies the standards and tools used in the development process;                                                Documents the specific tool options and tool configurations used in the development process; and                                                Documents, manages, and ensures the integrity of changes to the process and/or tools used in development; and                                                   Review the development process, standards, tools, tool options, and tool configurations  to determine if the process, standards, tools, tool options and tool configurations selected and employed can satisfy the following security and privacy requirements: .
domain SA System and Services Acquisition
baselines 
enhancements SA-15(1) SA-15(10) SA-15(11) SA-15(12) SA-15(13) SA-15(2) SA-15(3) SA-15(4) SA-15(5) SA-15(6) SA-15(7) SA-15(8) SA-15(9)
id NIST.SP.800-53r5 SA-16
section Developer-provided Training
- Require the developer of the system, system component, or system service to provide the following training on the correct use and operation of the implemented security and privacy functions, controls, and/or mechanisms: .
domain SA System and Services Acquisition
baselines 
enhancements 
id NIST.SP.800-53r5 SA-17
section Developer Security and Privacy Architecture and Design
- Require the developer of the system, system component, or system service to produce a design specification and security and privacy architecture that:                               Is consistent with the organization’s security and privacy architecture that is an integral part the organization’s enterprise architecture;                                        Accurately and completely describes the required security and privacy functionality, and the allocation of controls among physical and logical components; and                                        Expresses how individual security and privacy functions, mechanisms, and services work together to provide required security and privacy capabilities and a unified approach to protection.
domain SA System and Services Acquisition
baselines 
enhancements SA-17(1) SA-17(2) SA-17(3) SA-17(4) SA-17(5) SA-17(6) SA-17(7) SA-17(8) SA-17(9)
id NIST.SP.800-53r5 SA-18
section Tamper Resistance and Detection
- Tamper Resistance and Detection
domain SA System and Services Acquisition
baselines 
enhancements SA-18(1) SA-18(2)
id NIST.SP.800-53r5 SA-19
section Component Authenticity
- Component Authenticity
domain SA System and Services Acquisition
baselines 
enhancements SA-19(1) SA-19(2) SA-19(3) SA-19(4)
id NIST.SP.800-53r5 SA-2
section Allocation of Resources
- Determine the high-level information security and privacy requirements for the system or system service in mission and business process planning;                                        Determine, document, and allocate the resources required to protect the system or system service as part of the organizational capital planning and investment control process; and                                        Establish a discrete line item for information security and privacy in organizational programming and budgeting documentation.
domain SA System and Services Acquisition
baselines 
enhancements 
id NIST.SP.800-53r5 SA-20
section Customized Development of Critical Components
- Reimplement or custom develop the following critical system components: .
domain SA System and Services Acquisition
baselines 
enhancements 
id NIST.SP.800-53r5 SA-21
section Developer Screening
- Require that the developer of :                               Has appropriate access authorizations as determined by assigned  ; and                                        Satisfies the following additional personnel screening criteria: .
domain SA System and Services Acquisition
baselines 
enhancements SA-21(1)
id NIST.SP.800-53r5 SA-22
section Unsupported System Components
- Replace system components when support for the components is no longer available from the developer, vendor, or manufacturer; or                                        Provide the following options for alternative sources for continued support for unsupported components .
domain SA System and Services Acquisition
baselines 
enhancements SA-22(1)
id NIST.SP.800-53r5 SA-23
section Specialization
- Employ  on  supporting mission essential services or functions to increase the trustworthiness in those systems or components.
domain SA System and Services Acquisition
baselines 
enhancements 
id NIST.SP.800-53r5 SA-24
section Design For Cyber Resiliency
- Design organizational systems, system components, or system services to achieve cyber resiliency by:                                     Defining the following cyber resiliency goals: .                                                Defining the following cyber resiliency objectives: .                                                Defining the following cyber resiliency techniques: .                                                Defining the following cyber resiliency implementation approaches: .                                                Defining the following cyber resiliency design principles: .                                                   Implement the selected cyber resiliency goals, objectives, techniques, implementation approaches, and design principles as part of an organizational risk management process or systems security engineering process.
domain SA System and Services Acquisition
baselines 
enhancements 
id NIST.SP.800-53r5 SA-3
section System Development Life Cycle
- Acquire, develop, and manage the system using  that incorporates information security and privacy considerations;                                        Define and document information security and privacy roles and responsibilities throughout the system development life cycle;                                        Identify individuals having information security and privacy roles and responsibilities; and                                        Integrate the organizational information security and privacy risk management process into system development life cycle activities.
domain SA System and Services Acquisition
baselines 
enhancements SA-3(1) SA-3(2) SA-3(3)
id NIST.SP.800-53r5 SA-4
section Acquisition Process
- Include the following requirements, descriptions, and criteria, explicitly or by reference, using  in the acquisition contract for the system, system component, or system service:                               Security and privacy functional requirements;                                        Strength of mechanism requirements;                                        Security and privacy assurance requirements;                                        Controls needed to satisfy the security and privacy requirements.                                        Security and privacy documentation requirements;                                        Requirements for protecting security and privacy documentation;                                        Description of the system development environment and environment in which the system is intended to operate;                                        Allocation of responsibility or identification of parties responsible for information security, privacy, and supply chain risk management; and                                        Acceptance criteria.
domain SA System and Services Acquisition
baselines 
enhancements SA-4(1) SA-4(10) SA-4(11) SA-4(12) SA-4(2) SA-4(3) SA-4(4) SA-4(5) SA-4(6) SA-4(7) SA-4(8) SA-4(9)
id NIST.SP.800-53r5 SA-5
section System Documentation
- Obtain or develop administrator documentation for the system, system component, or system service that describes:                                     Secure configuration, installation, and operation of the system, component, or service;                                                Effective use and maintenance of security and privacy functions and mechanisms; and                                                Known vulnerabilities regarding configuration and use of administrative or privileged functions;                                                   Obtain or develop user documentation for the system, system component, or system service that describes:                                     User-accessible security and privacy functions and mechanisms and how to effectively use those functions and mechanisms;                                                Methods for user interaction, which enables individuals to use the system, component, or service in a more secure manner and protect individual privacy; and                                                User responsibilities in maintaining the security of the system, component, or service and privacy of individuals;                                                   Document attempts to obtain system, system component, or system service documentation when such documentation is either unavailable or nonexistent and take  in response; and                                        Distribute documentation to .
domain SA System and Services Acquisition
baselines 
enhancements SA-5(1) SA-5(2) SA-5(3) SA-5(4) SA-5(5)
id NIST.SP.800-53r5 SA-6
section Software Usage Restrictions
- Software Usage Restrictions
domain SA System and Services Acquisition
baselines 
enhancements 
id NIST.SP.800-53r5 SA-7
section User-installed Software
- User-installed Software
domain SA System and Services Acquisition
baselines 
enhancements 
id NIST.SP.800-53r5 SA-8
section Security and Privacy Engineering Principles
- Apply the following systems security and privacy engineering principles in the specification, design, development, implementation, and modification of the system and system components: .
domain SA System and Services Acquisition
baselines 
enhancements SA-8(1) SA-8(10) SA-8(11) SA-8(12) SA-8(13) SA-8(14) SA-8(15) SA-8(16) SA-8(17) SA-8(18) SA-8(19) SA-8(2) SA-8(20) SA-8(21) SA-8(22) SA-8(23) SA-8(24) SA-8(25) SA-8(26) SA-8(27) SA-8(28) SA-8(29) SA-8(3) SA-8(30) SA-8(31) SA-8(32) SA-8(33) SA-8(4) SA-8(5) SA-8(6) SA-8(7) SA-8(8) SA-8(9)
id NIST.SP.800-53r5 SA-9
section External System Services
- Require that providers of external system services comply with organizational security and privacy requirements and employ the following controls: ;                                        Define and document organizational oversight and user roles and responsibilities with regard to external system services; and                                        Employ the following processes, methods, and techniques to monitor control compliance by external service providers on an ongoing basis: .
domain SA System and Services Acquisition
baselines 
enhancements SA-9(1) SA-9(2) SA-9(3) SA-9(4) SA-9(5) SA-9(6) SA-9(7) SA-9(8)
id NIST.SP.800-53r5 SC-1
section Policy and Procedures
- Develop, document, and disseminate to :                                      system and communications protection policy that:                                           Addresses purpose, scope, roles, responsibilities, management commitment, coordination among organizational entities, and compliance; and                                                        Is consistent with applicable laws, executive orders, directives, regulations, policies, standards, and guidelines; and                                                             Procedures to facilitate the implementation of the system and communications protection policy and the associated system and communications protection controls;                                                   Designate an  to manage the development, documentation, and dissemination of the system and communications protection policy and procedures; and                                        Review and update the current system and communications protection:                                     Policy  and following  ; and                                                Procedures  and following .
domain SC System and Communications Protection
baselines 
enhancements 
id NIST.SP.800-53r5 SC-10
section Network Disconnect
- Terminate the network connection associated with a communications session at the end of the session or after  of inactivity.
domain SC System and Communications Protection
baselines 
enhancements 
id NIST.SP.800-53r5 SC-11
section Trusted Path
- Provide a  isolated trusted communications path for communications between the user and the trusted components of the system; and                                        Permit users to invoke the trusted communications path for communications between the user and the following security functions of the system, including at a minimum, authentication and re-authentication: .
domain SC System and Communications Protection
baselines 
enhancements SC-11(1)
id NIST.SP.800-53r5 SC-12
section Cryptographic Key Establishment and Management
- Establish and manage cryptographic keys when cryptography is employed within the system in accordance with the following key management requirements: .
domain SC System and Communications Protection
baselines 
enhancements SC-12(1) SC-12(2) SC-12(3) SC-12(4) SC-12(5) SC-12(6)
id NIST.SP.800-53r5 SC-13
section Cryptographic Protection
- Determine the  ; and                                        Implement the following types of cryptography required for each specified cryptographic use: .
domain SC System and Communications Protection
baselines 
enhancements SC-13(1) SC-13(2) SC-13(3) SC-13(4)
id NIST.SP.800-53r5 SC-14
section Public Access Protections
- Public Access Protections
domain SC System and Communications Protection
baselines 
enhancements 
id NIST.SP.800-53r5 SC-15
section Collaborative Computing Devices and Applications
- Prohibit remote activation of collaborative computing devices and applications with the following exceptions:  ; and                                        Provide an explicit indication of use to users physically present at the devices.
domain SC System and Communications Protection
baselines 
enhancements SC-15(1) SC-15(2) SC-15(3) SC-15(4)
id NIST.SP.800-53r5 SC-16
section Transmission of Security and Privacy Attributes
- Associate  with information exchanged between systems and between system components.
domain SC System and Communications Protection
baselines 
enhancements SC-16(1) SC-16(2) SC-16(3)
id NIST.SP.800-53r5 SC-17
section Public Key Infrastructure Certificates
- Issue public key certificates under an  or obtain public key certificates from an approved service provider; and                                        Include only approved trust anchors in trust stores or certificate stores managed by the organization.
domain SC System and Communications Protection
baselines 
enhancements 
id NIST.SP.800-53r5 SC-18
section Mobile Code
- Define acceptable and unacceptable mobile code and mobile code technologies; and                                        Authorize, monitor, and control the use of mobile code within the system.
domain SC System and Communications Protection
baselines 
enhancements SC-18(1) SC-18(2) SC-18(3) SC-18(4) SC-18(5)
id NIST.SP.800-53r5 SC-19
section Voice Over Internet Protocol
- Technology-specific; addressed as any other technology or protocol.
domain SC System and Communications Protection
baselines 
enhancements 
id NIST.SP.800-53r5 SC-2
section Separation of System and User Functionality
- Separate user functionality, including user interface services, from system management functionality.
domain SC System and Communications Protection
baselines 
enhancements SC-2(1) SC-2(2)
id NIST.SP.800-53r5 SC-20
section Secure Name/Address Resolution Service (Authoritative Source)
- Provide additional data origin authentication and integrity verification artifacts along with the authoritative name resolution data the system returns in response to external name/address resolution queries; and                                        Provide the means to indicate the security status of child zones and (if the child supports secure resolution services) to enable verification of a chain of trust among parent and child domains, when operating as part of a distributed, hierarchical namespace.
domain SC System and Communications Protection
baselines 
enhancements SC-20(1) SC-20(2)
id NIST.SP.800-53r5 SC-21
section Secure Name/Address Resolution Service (Recursive or Caching Resolver)
- Request and perform data origin authentication and data integrity verification on the name/address resolution responses the system receives from authoritative sources.
domain SC System and Communications Protection
baselines 
enhancements SC-21(1)
id NIST.SP.800-53r5 SC-22
section Architecture and Provisioning for Name/Address Resolution Service
- Ensure the systems that collectively provide name/address resolution service for an organization are fault-tolerant and implement internal and external role separation.
domain SC System and Communications Protection
baselines 
enhancements 
id NIST.SP.800-53r5 SC-23
section Session Authenticity
- Protect the authenticity of communications sessions.
domain SC System and Communications Protection
baselines 
enhancements SC-23(1) SC-23(2) SC-23(3) SC-23(4) SC-23(5)
id NIST.SP.800-53r5 SC-24
section Fail in Known State
- Fail to a  for the following failures on the indicated components while preserving  in failure: .
domain SC System and Communications Protection
baselines 
enhancements 
id NIST.SP.800-53r5 SC-25
section Thin Nodes
- Employ minimal functionality and information storage on the following system components: .
domain SC System and Communications Protection
baselines 
enhancements 
id NIST.SP.800-53r5 SC-26
section Decoys
- Include components within organizational systems specifically designed to be the target of malicious attacks for detecting, deflecting, and analyzing such attacks.
domain SC System and Communications Protection
baselines 
enhancements SC-26(1)
id NIST.SP.800-53r5 SC-27
section Platform-independent Applications
- Include within organizational systems the following platform independent applications: .
domain SC System and Communications Protection
baselines 
enhancements 
id NIST.SP.800-53r5 SC-28
section Protection of Information at Rest
- Protect the  of the following information at rest: .
domain SC System and Communications Protection
baselines 
enhancements SC-28(1) SC-28(2) SC-28(3)
id NIST.SP.800-53r5 SC-29
section Heterogeneity
- Employ a diverse set of information technologies for the following system components in the implementation of the system: .
domain SC System and Communications Protection
baselines 
enhancements SC-29(1)
id NIST.SP.800-53r5 SC-3
section Security Function Isolation
- Isolate security functions from nonsecurity functions.
domain SC System and Communications Protection
baselines 
enhancements SC-3(1) SC-3(2) SC-3(3) SC-3(4) SC-3(5)
id NIST.SP.800-53r5 SC-30
section Concealment and Misdirection
- Employ the following concealment and misdirection techniques for  at  to confuse and mislead adversaries: .
domain SC System and Communications Protection
baselines 
enhancements SC-30(1) SC-30(2) SC-30(3) SC-30(4) SC-30(5)
id NIST.SP.800-53r5 SC-31
section Covert Channel Analysis
- Perform a covert channel analysis to identify those aspects of communications within the system that are potential avenues for covert  channels; and                                        Estimate the maximum bandwidth of those channels.
domain SC System and Communications Protection
baselines 
enhancements SC-31(1) SC-31(2) SC-31(3)
id NIST.SP.800-53r5 SC-32
section System Partitioning
- Partition the system into  residing in separate  domains or environments based on .
domain SC System and Communications Protection
baselines 
enhancements SC-32(1)
id NIST.SP.800-53r5 SC-33
section Transmission Preparation Integrity
- Transmission Preparation Integrity
domain SC System and Communications Protection
baselines 
enhancements 
id NIST.SP.800-53r5 SC-34
section Non-modifiable Executable Programs
- For  , load and execute:                               The operating environment from hardware-enforced, read-only media; and                                        The following applications from hardware-enforced, read-only media: .
domain SC System and Communications Protection
baselines 
enhancements SC-34(1) SC-34(2) SC-34(3)
id NIST.SP.800-53r5 SC-35
section External Malicious Code Identification
- Include system components that proactively seek to identify network-based malicious code or malicious websites.
domain SC System and Communications Protection
baselines 
enhancements 
id NIST.SP.800-53r5 SC-36
section Distributed Processing and Storage
- Distribute the following processing and storage components across multiple : .
domain SC System and Communications Protection
baselines 
enhancements SC-36(1) SC-36(2)
id NIST.SP.800-53r5 SC-37
section Out-of-band Channels
- Employ the following out-of-band channels for the physical delivery or electronic transmission of  to : .
domain SC System and Communications Protection
baselines 
enhancements SC-37(1)
id NIST.SP.800-53r5 SC-38
section Operations Security
- Employ the following operations security controls to protect key organizational information throughout the system development life cycle: .
domain SC System and Communications Protection
baselines 
enhancements 
id NIST.SP.800-53r5 SC-39
section Process Isolation
- Maintain a separate execution domain for each executing system process.
domain SC System and Communications Protection
baselines 
enhancements SC-39(1) SC-39(2)
id NIST.SP.800-53r5 SC-4
section Information in Shared System Resources
- Prevent unauthorized and unintended information transfer via shared system resources.
domain SC System and Communications Protection
baselines 
enhancements SC-4(1) SC-4(2)
id NIST.SP.800-53r5 SC-40
section Wireless Link Protection
- Protect external and internal  from the following signal parameter attacks: .
domain SC System and Communications Protection
baselines 
enhancements SC-40(1) SC-40(2) SC-40(3) SC-40(4)
id NIST.SP.800-53r5 SC-41
section Port and I/O Device Access
- disable or remove  on the following systems or system components: .
domain SC System and Communications Protection
baselines 
enhancements 
id NIST.SP.800-53r5 SC-42
section Sensor Capability and Data
- Prohibit  ; and                                        Provide an explicit indication of sensor use to .
domain SC System and Communications Protection
baselines 
enhancements SC-42(1) SC-42(2) SC-42(3) SC-42(4) SC-42(5)
id NIST.SP.800-53r5 SC-43
section Usage Restrictions
- Establish usage restrictions and implementation guidelines for the following system components:  ; and                                        Authorize, monitor, and control the use of such components within the system.
domain SC System and Communications Protection
baselines 
enhancements 
id NIST.SP.800-53r5 SC-44
section Detonation Chambers
- Employ a detonation chamber capability within .
domain SC System and Communications Protection
baselines 
enhancements 
id NIST.SP.800-53r5 SC-45
section System Time Synchronization
- Synchronize system clocks within and between systems and system components.
domain SC System and Communications Protection
baselines 
enhancements SC-45(1) SC-45(2)
id NIST.SP.800-53r5 SC-46
section Cross Domain Policy Enforcement
- Implement a policy enforcement mechanism  between the physical and/or network interfaces for the connecting security domains.
domain SC System and Communications Protection
baselines 
enhancements 
id NIST.SP.800-53r5 SC-47
section Alternate Communications Paths
- Establish  for system operations organizational command and control.
domain SC System and Communications Protection
baselines 
enhancements 
id NIST.SP.800-53r5 SC-48
section Sensor Relocation
- Relocate  to  under the following conditions or circumstances: .
domain SC System and Communications Protection
baselines 
enhancements SC-48(1)
id NIST.SP.800-53r5 SC-49
section Hardware-enforced Separation and Policy Enforcement
- Implement hardware-enforced separation and policy enforcement mechanisms between .
domain SC System and Communications Protection
baselines 
enhancements 
id NIST.SP.800-53r5 SC-5
section Denial-of-service Protection
- the effects of the following types of denial-of-service events:  ; and                                        Employ the following controls to achieve the denial-of-service objective: .
domain SC System and Communications Protection
baselines 
enhancements SC-5(1) SC-5(2) SC-5(3)
id NIST.SP.800-53r5 SC-50
section Software-enforced Separation and Policy Enforcement
- Implement software-enforced separation and policy enforcement mechanisms between .
domain SC System and Communications Protection
baselines 
enhancements 
id NIST.SP.800-53r5 SC-51
section Hardware-based Protection
- Employ hardware-based, write-protect for  ; and                                        Implement specific procedures for  to manually disable hardware write-protect for firmware modifications and re-enable the write-protect prior to returning to operational mode.
domain SC System and Communications Protection
baselines 
enhancements 
id NIST.SP.800-53r5 SC-6
section Resource Availability
- Protect the availability of resources by allocating  by .
domain SC System and Communications Protection
baselines 
enhancements 
id NIST.SP.800-53r5 SC-7
section Boundary Protection
- Monitor and control communications at the external managed interfaces to the system and at key internal managed interfaces within the system;                                        Implement subnetworks for publicly accessible system components that are  separated from internal organizational networks; and                                        Connect to external networks or systems only through managed interfaces consisting of boundary protection devices arranged in accordance with an organizational security and privacy architecture.
domain SC System and Communications Protection
baselines 
enhancements SC-7(1) SC-7(10) SC-7(11) SC-7(12) SC-7(13) SC-7(14) SC-7(15) SC-7(16) SC-7(17) SC-7(18) SC-7(19) SC-7(2) SC-7(20) SC-7(21) SC-7(22) SC-7(23) SC-7(24) SC-7(25) SC-7(26) SC-7(27) SC-7(28) SC-7(29) SC-7(3) SC-7(4) SC-7(5) SC-7(6) SC-7(7) SC-7(8) SC-7(9)
id NIST.SP.800-53r5 SC-8
section Transmission Confidentiality and Integrity
- Protect the  of transmitted information.
domain SC System and Communications Protection
baselines 
enhancements SC-8(1) SC-8(2) SC-8(3) SC-8(4) SC-8(5)
id NIST.SP.800-53r5 SC-9
section Transmission Confidentiality
- Transmission Confidentiality
domain SC System and Communications Protection
baselines 
enhancements 
id NIST.SP.800-53r5 SI-1
section Policy and Procedures
- Develop, document, and disseminate to :                                      system and information integrity policy that:                                           Addresses purpose, scope, roles, responsibilities, management commitment, coordination among organizational entities, and compliance; and                                                        Is consistent with applicable laws, executive orders, directives, regulations, policies, standards, and guidelines; and                                                             Procedures to facilitate the implementation of the system and information integrity policy and the associated system and information integrity controls;                                                   Designate an  to manage the development, documentation, and dissemination of the system and information integrity policy and procedures; and                                        Review and update the current system and information integrity:                                     Policy  and following  ; and                                                Procedures  and following .
domain SI System and Information Integrity
baselines 
enhancements 
id NIST.SP.800-53r5 SI-10
section Information Input Validation
- Check the validity of the following information inputs: .
domain SI System and Information Integrity
baselines 
enhancements SI-10(1) SI-10(2) SI-10(3) SI-10(4) SI-10(5) SI-10(6)
id NIST.SP.800-53r5 SI-11
section Error Handling
- Generate error messages that provide information necessary for corrective actions without revealing information that could be exploited; and                                        Reveal error messages only to .
domain SI System and Information Integrity
baselines 
enhancements 
id NIST.SP.800-53r5 SI-12
section Information Management and Retention
- Manage and retain information within the system and information output from the system in accordance with applicable laws, executive orders, directives, regulations, policies, standards, guidelines and operational requirements.
domain SI System and Information Integrity
baselines 
enhancements SI-12(1) SI-12(2) SI-12(3)
id NIST.SP.800-53r5 SI-13
section Predictable Failure Prevention
- Determine mean time to failure (MTTF) for the following system components in specific environments of operation:  ; and                                        Provide substitute system components and a means to exchange active and standby components in accordance with the following criteria: .
domain SI System and Information Integrity
baselines 
enhancements SI-13(1) SI-13(2) SI-13(3) SI-13(4) SI-13(5)
id NIST.SP.800-53r5 SI-14
section Non-persistence
- Implement non-persistent  that are initiated in a known state and terminated .
domain SI System and Information Integrity
baselines 
enhancements SI-14(1) SI-14(2) SI-14(3)
id NIST.SP.800-53r5 SI-15
section Information Output Filtering
- Validate information output from the following software programs and/or applications to ensure that the information is consistent with the expected content: .
domain SI System and Information Integrity
baselines 
enhancements 
id NIST.SP.800-53r5 SI-16
section Memory Protection
- Implement the following controls to protect the system memory from unauthorized code execution: .
domain SI System and Information Integrity
baselines 
enhancements 
id NIST.SP.800-53r5 SI-17
section Fail-safe Procedures
- Implement the indicated fail-safe procedures when the indicated failures occur: .
domain SI System and Information Integrity
baselines 
enhancements 
id NIST.SP.800-53r5 SI-18
section Personally Identifiable Information Quality Operations
- Check the accuracy, relevance, timeliness, and completeness of personally identifiable information across the information life cycle  ; and                                        Correct or delete inaccurate or outdated personally identifiable information.
domain SI System and Information Integrity
baselines 
enhancements SI-18(1) SI-18(2) SI-18(3) SI-18(4) SI-18(5)
id NIST.SP.800-53r5 SI-19
section De-identification
- Remove the following elements of personally identifiable information from datasets:  ; and                                        Evaluate  for effectiveness of de-identification.
domain SI System and Information Integrity
baselines 
enhancements SI-19(1) SI-19(2) SI-19(3) SI-19(4) SI-19(5) SI-19(6) SI-19(7) SI-19(8)
id NIST.SP.800-53r5 SI-2
section Flaw Remediation
- Identify, report, and correct system flaws;                                        Test software and firmware updates related to flaw remediation for effectiveness and potential side effects before installation;                                        Install security-relevant software and firmware updates within  of the release of the updates; and                                        Incorporate flaw remediation into the organizational configuration management process.
domain SI System and Information Integrity
baselines 
enhancements SI-2(1) SI-2(2) SI-2(3) SI-2(4) SI-2(5) SI-2(6) SI-2(7)
id NIST.SP.800-53r5 SI-20
section Tainting
- Embed data or capabilities in the following systems or system components to determine if organizational data has been exfiltrated or improperly removed from the organization: .
domain SI System and Information Integrity
baselines 
enhancements 
id NIST.SP.800-53r5 SI-21
section Information Refresh
- Refresh  at  or generate the information on demand and delete the information when no longer needed.
domain SI System and Information Integrity
baselines 
enhancements 
id NIST.SP.800-53r5 SI-22
section Information Diversity
- Identify the following alternative sources of information for :  ; and                                        Use an alternative information source for the execution of essential functions or services on  when the primary source of information is corrupted or unavailable.
domain SI System and Information Integrity
baselines 
enhancements 
id NIST.SP.800-53r5 SI-23
section Information Fragmentation
- Based on :                               Fragment the following information:  ; and                                        Distribute the fragmented information across the following systems or system components: .
domain SI System and Information Integrity
baselines 
enhancements 
id NIST.SP.800-53r5 SI-3
section Malicious Code Protection
- Implement  malicious code protection mechanisms at system entry and exit points to detect and eradicate malicious code;                                        Automatically update malicious code protection mechanisms as new releases are available in accordance with organizational configuration management policy and procedures;                                        Configure malicious code protection mechanisms to:                                     Perform periodic scans of the system  and real-time scans of files from external sources at  as the files are downloaded, opened, or executed in accordance with organizational policy; and                                                 ; and send alert to  in response to malicious code detection; and                                                   Address the receipt of false positives during malicious code detection and eradication and the resulting potential impact on the availability of the system.
domain SI System and Information Integrity
baselines 
enhancements SI-3(1) SI-3(10) SI-3(2) SI-3(3) SI-3(4) SI-3(5) SI-3(6) SI-3(7) SI-3(8) SI-3(9)
id NIST.SP.800-53r5 SI-4
section System Monitoring
- Monitor the system to detect:                                     Attacks and indicators of potential attacks in accordance with the following monitoring objectives:  ; and                                                Unauthorized local, network, and remote connections;                                                   Identify unauthorized use of the system through the following techniques and methods: ;                                        Invoke internal monitoring capabilities or deploy monitoring devices:                                     Strategically within the system to collect organization-determined essential information; and                                                At ad hoc locations within the system to track specific types of transactions of interest to the organization;                                                   Analyze detected events and anomalies;                                        Adjust the level of system monitoring activity when there is a change in risk to organizational operations and assets, individuals, other organizations, or the Nation;                                        Obtain legal opinion regarding system monitoring activities; and                                        Provide  to  .
domain SI System and Information Integrity
baselines 
enhancements SI-4(1) SI-4(10) SI-4(11) SI-4(12) SI-4(13) SI-4(14) SI-4(15) SI-4(16) SI-4(17) SI-4(18) SI-4(19) SI-4(2) SI-4(20) SI-4(21) SI-4(22) SI-4(23) SI-4(24) SI-4(25) SI-4(3) SI-4(4) SI-4(5) SI-4(6) SI-4(7) SI-4(8) SI-4(9)
id NIST.SP.800-53r5 SI-5
section Security Alerts, Advisories, and Directives
- Receive system security alerts, advisories, and directives from  on an ongoing basis;                                        Generate internal security alerts, advisories, and directives as deemed necessary;                                        Disseminate security alerts, advisories, and directives to:  ; and                                        Implement security directives in accordance with established time frames, or notify the issuing organization of the degree of noncompliance.
domain SI System and Information Integrity
baselines 
enhancements SI-5(1)
id NIST.SP.800-53r5 SI-6
section Security and Privacy Function Verification
- Verify the correct operation of ;                                        Perform the verification of the functions specified in SI-6a ;                                        Alert  to failed security and privacy verification tests; and                                         when anomalies are discovered.
domain SI System and Information Integrity
baselines 
enhancements SI-6(1) SI-6(2) SI-6(3)
id NIST.SP.800-53r5 SI-7
section Software, Firmware, and Information Integrity
- Employ integrity verification tools to detect unauthorized changes to the following software, firmware, and information:  ; and                                        Take the following actions when unauthorized changes to the software, firmware, and information are detected: .
domain SI System and Information Integrity
baselines 
enhancements SI-7(1) SI-7(10) SI-7(11) SI-7(12) SI-7(13) SI-7(14) SI-7(15) SI-7(16) SI-7(17) SI-7(2) SI-7(3) SI-7(4) SI-7(5) SI-7(6) SI-7(7) SI-7(8) SI-7(9)
id NIST.SP.800-53r5 SI-8
section Spam Protection
- Employ spam protection mechanisms at system entry and exit points to detect and act on unsolicited messages; and                                        Update spam protection mechanisms when new releases are available in accordance with organizational configuration management policy and procedures.
domain SI System and Information Integrity
baselines 
enhancements SI-8(1) SI-8(2) SI-8(3)
id NIST.SP.800-53r5 SI-9
section Information Input Restrictions
- Information Input Restrictions
domain SI System and Information Integrity
baselines 
enhancements 
id NIST.SP.800-53r5 SR-1
section Policy and Procedures
- Develop, document, and disseminate to :                                      supply chain risk management policy that:                                           Addresses purpose, scope, roles, responsibilities, management commitment, coordination among organizational entities, and compliance; and                                                        Is consistent with applicable laws, executive orders, directives, regulations, policies, standards, and guidelines; and                                                             Procedures to facilitate the implementation of the supply chain risk management policy and the associated supply chain risk management controls;                                                   Designate an  to manage the development, documentation, and dissemination of the supply chain risk management policy and procedures; and                                        Review and update the current supply chain risk management:                                     Policy  and following  ; and                                                Procedures  and following .
domain SR Supply Chain Risk Management
baselines 
enhancements 
id NIST.SP.800-53r5 SR-10
section Inspection of Systems or Components
- Inspect the following systems or system components  to detect tampering: .
domain SR Supply Chain Risk Management
baselines 
enhancements 
id NIST.SP.800-53r5 SR-11
section Component Authenticity
- Develop and implement anti-counterfeit policy and procedures that include the means to detect and prevent counterfeit components from entering the system; and                                        Report counterfeit system components to .
domain SR Supply Chain Risk Management
baselines 
enhancements SR-11(1) SR-11(2) SR-11(3)
id NIST.SP.800-53r5 SR-12
section Component Disposal
- Dispose of  using the following techniques and methods: .
domain SR Supply Chain Risk Management
baselines 
enhancements 
id NIST.SP.800-53r5 SR-2
section Supply Chain Risk Management Plan
- Develop a plan for managing supply chain risks associated with the research and development, design, manufacturing, acquisition, delivery, integration, operations and maintenance, and disposal of the following systems, system components or system services: ;                                        Review and update the supply chain risk management plan  or as required, to address threat, organizational or environmental changes; and                                        Protect the supply chain risk management plan from unauthorized disclosure and modification.
domain SR Supply Chain Risk Management
baselines 
enhancements SR-2(1)
id NIST.SP.800-53r5 SR-3
section Supply Chain Controls and Processes
- Establish a process or processes to identify and address weaknesses or deficiencies in the supply chain elements and processes of  in coordination with ;                                        Employ the following controls to protect against supply chain risks to the system, system component, or system service and to limit the harm or consequences from supply chain-related events:  ; and                                        Document the selected and implemented supply chain processes and controls in .
domain SR Supply Chain Risk Management
baselines 
enhancements SR-3(1) SR-3(2) SR-3(3)
id NIST.SP.800-53r5 SR-4
section Provenance
- Document, monitor, and maintain valid provenance of the following systems, system components, and associated data: .
domain SR Supply Chain Risk Management
baselines 
enhancements SR-4(1) SR-4(2) SR-4(3) SR-4(4)
id NIST.SP.800-53r5 SR-5
section Acquisition Strategies, Tools, and Methods
- Employ the following acquisition strategies, contract tools, and procurement methods to protect against, identify, and mitigate supply chain risks: .
domain SR Supply Chain Risk Management
baselines 
enhancements SR-5(1) SR-5(2)
id NIST.SP.800-53r5 SR-6
section Supplier Assessments and Reviews
- Assess and review the supply chain-related risks associated with suppliers or contractors and the system, system component, or system service they provide .
domain SR Supply Chain Risk Management
baselines 
enhancements SR-6(1)
id NIST.SP.800-53r5 SR-7
section Supply Chain Operations Security
- Employ the following Operations Security (OPSEC) controls to protect supply chain-related information for the system, system component, or system service: .
domain SR Supply Chain Risk Management
baselines 
enhancements 
id NIST.SP.800-53r5 SR-8
section Notification Agreements
- Establish agreements and procedures with entities involved in the supply chain for the system, system component, or system service for the .
domain SR Supply Chain Risk Management
baselines 
enhancements 
id NIST.SP.800-53r5 SR-9
section Tamper Resistance and Detection
- Implement a tamper protection program for the system, system component, or system service.
domain SR Supply Chain Risk Management
baselines 
enhancements SR-9(1)
